[
    "\nRecipe: Garlic Herb Roasted Chicken\nIngredients: chicken, garlic, olive oil, rosemary, thyme, salt, pepper\nInstructions:\n1. Preheat the oven to 400F (200C).\n2. In a small bowl, mix minced garlic, olive oil, chopped rosemary, thyme, salt, and pepper to create a marinade.\n3. Place the chicken in a baking dish and rub the marinade all over it, ensuring it's evenly coated.\n4. Roast the chicken in the preheated oven for about 45-50 minutes or until the internal temperature reaches 165F (74C).\n5. Let the chicken rest for a few minutes before slicing and serving.\n",
    "\nRecipe: Rice and Beans\nIngredients: rice, beans, onion, garlic, bell pepper, tomato, cumin, paprika, salt, pepper, cilantro\nInstructions:\n1. Rinse the rice under cold water until the water runs clear.\n2. In a large pot, heat some oil over medium heat and saut the onion, garlic, and bell pepper until softened.\n3. Add the rice and stir to coat in the oil and vegetables.\n4. Pour in water or broth, add the cumin, paprika, salt, and pepper, and bring to a boil.\n5. Reduce heat to low, cover, and simmer for about 15-20 minutes or until the rice is cooked.\n6. In a separate pan, heat some oil and saut the beans with diced tomato until heated through.\n7. Season the beans with salt, pepper, and cilantro.\n8. Serve the rice topped with the beans mixture.\n9. Enjoy your delicious rice and beans!\n",
    "\nRecipe: Cheesy Tomato Pasta\nIngredients: pasta, tomato sauce, cheese, olive oil, garlic, salt, pepper\nInstructions:\n1. Cook the pasta according to package Instructions until al dente.\n2. In a separate pan, heat olive oil over medium heat and saut minced garlic until fragrant.\n3. Add tomato sauce to the pan and simmer for a few minutes.\n4. Stir in cooked pasta and mix well with the tomato sauce.\n5. Add salt and pepper to taste.\n6. Sprinkle grated cheese on top and let it melt.\n7. Serve hot and enjoy!\n",
    "\nRecipe: Bacon, Egg, and Cheese Breakfast Sandwich\nIngredients: eggs, bacon, bread, cheese, butter\nInstructions:\n1. Cook the bacon in a skillet until crispy, then set aside on a paper towel to drain.\n2. In the same skillet, fry the eggs to your desired doneness.\n3. While the eggs are cooking, toast the bread slices in a toaster or on a skillet with a little butter.\n4. Assemble the sandwich by placing a slice of cheese on one slice of bread, followed by the cooked bacon, fried egg, and the second slice of bread on top.\n5. Enjoy your delicious Bacon, Egg, and Cheese Breakfast Sandwich!\n",
    "\nRecipe: Beef Stew\nIngredients: potatoes, onions, carrots, beef, beef broth, garlic, thyme, salt, pepper\nInstructions:\n1. Heat oil in a large pot over medium heat.\n2. Add diced onions and minced garlic, cook until onions are translucent.\n3. Add cubed beef, season with salt, pepper, and thyme. Cook until beef is browned on all sides.\n4. Pour in beef broth and bring to a simmer. Cover and cook for 1 hour.\n5. Add diced potatoes and carrots, simmer for an additional 30 minutes or until vegetables are tender.\n6. Adjust seasoning if needed and serve hot.\n",
    "\nRecipe: Spinach Avocado Salad with Feta Cheese\nIngredients: spinach, avocado, cherry tomatoes, feta cheese, red onion, olive oil, lemon juice, salt, pepper\nInstructions:\n1. Wash and dry the spinach leaves, then place them in a large salad bowl.\n2. Cut the avocado into slices or cubes and add it to the bowl.\n3. Cut the cherry tomatoes in half and add them to the bowl.\n4. Crumble the feta cheese over the salad.\n5. Thinly slice the red onion and add it to the bowl.\n6. In a small bowl, whisk together olive oil, lemon juice, salt, and pepper to make the dressing.\n7. Drizzle the dressing over the salad and toss gently to combine all Ingredients.\n8. Serve and enjoy!\n",
    "\nRecipe: Lemon Dill Salmon\nIngredients: salmon, lemon, dill, garlic, olive oil, salt, pepper\nInstructions:\n1. Preheat the oven to 400F (200C).\n2. Place the salmon fillets on a baking sheet lined with parchment paper.\n3. Drizzle olive oil over the salmon fillets and season with salt and pepper.\n4. Squeeze lemon juice over the salmon and sprinkle chopped dill and minced garlic on top.\n5. Bake in the preheated oven for 12-15 minutes, or until the salmon is cooked through.\n6. Serve hot with additional lemon wedges on the side.\n",
    "\nRecipe: Quinoa Black Bean Salad\nIngredients: quinoa, black beans, corn, bell peppers, cherry tomatoes, red onion, avocado, cilantro, lime, olive oil, salt, pepper\nInstructions:\n1. Cook quinoa according to package Instructions and let it cool.\n2. In a large bowl, combine cooked quinoa, black beans, corn, diced bell peppers, halved cherry tomatoes, diced red onion, chopped avocado, and chopped cilantro.\n3. In a small bowl, whisk together lime juice, olive oil, salt, and pepper to make the dressing.\n4. Pour the dressing over the salad and toss gently to combine.\n5. Serve chilled and enjoy!\n",
    "\nRecipe: Ginger Soy Tofu Stir-Fry\nIngredients: tofu, soy sauce, ginger, broccoli, garlic, bell pepper, carrots, sesame oil, cornstarch, rice vinegar, brown sugar, green onions\nInstructions:\n1. Press tofu to remove excess water, then cut into cubes.\n2. In a small bowl, mix soy sauce, minced ginger, minced garlic, rice vinegar, brown sugar, and cornstarch to make the sauce.\n3. Heat sesame oil in a large pan or wok over medium-high heat.\n4. Add tofu cubes and cook until golden brown on all sides. Remove from pan and set aside.\n5. In the same pan, add more sesame oil if needed and stir-fry broccoli, sliced bell pepper, and julienned carrots until slightly tender.\n6. Add the tofu back to the pan and pour the sauce over the tofu and vegetables. Stir well to coat everything evenly.\n7. Cook for a few more minutes until the sauce thickens and everything is heated through.\n8. Serve hot, garnished with sliced green onions. Enjoy!\n",
    "\nRecipe: Vegetable Chicken Soup\nIngredients: mushrooms, zucchini, bell peppers, onions, chicken broth, chicken breast, carrots, celery, garlic, salt, pepper, olive oil\nInstructions:\n1. In a large pot, heat olive oil over medium heat.\n2. Add chopped onions, garlic, carrots, and celery. Cook until vegetables are softened.\n3. Add sliced mushrooms, zucchini, and bell peppers. Cook for a few minutes.\n4. Pour in chicken broth and bring to a simmer.\n5. Add diced chicken breast and season with salt and pepper.\n6. Let the soup simmer for about 20-25 minutes until chicken is cooked through and vegetables are tender.\n7. Taste and adjust seasoning if needed.\n8. Serve hot and enjoy!\n",
    "\nRecipe: Vegetable Fried Rice\nIngredients: rice, vegetables, soy sauce, garlic, onion, carrots, peas, eggs, sesame oil\nInstructions:\n1. Cook rice according to package Instructions and let it cool.\n2. In a large pan, heat sesame oil over medium heat.\n3. Add minced garlic and chopped onion, saut until fragrant.\n4. Add diced carrots and cook until slightly softened.\n5. Push vegetables to one side of the pan and scramble eggs on the other side.\n6. Once eggs are cooked, mix them with the vegetables.\n7. Add cooked rice, peas, and soy sauce to the pan.\n8. Stir well to combine all Ingredients and cook for a few more minutes.\n9. Serve hot and enjoy!\n",
    "\nRecipe: Beef Stew\nIngredients: beef, potatoes, carrots, onions, beef broth, garlic, thyme, salt, pepper\nInstructions:\n1. In a large pot, brown the beef over medium-high heat.\n2. Add the onions and garlic, cook until fragrant.\n3. Stir in the potatoes, carrots, thyme, salt, and pepper.\n4. Pour in enough beef broth to cover the Ingredients.\n5. Bring to a boil, then reduce heat and simmer for 1-2 hours until beef is tender.\n6. Serve hot and enjoy!\n",
    "\nRecipe: Garlic Butter Lemon Salmon\nIngredients: salmon, lemon, garlic, butter, salt, black pepper, fresh parsley\nInstructions:\n1. Preheat the oven to 375F (190C).\n2. Place the salmon fillets on a baking sheet lined with parchment paper.\n3. In a small bowl, mix melted butter, minced garlic, lemon juice, salt, and black pepper.\n4. Brush the butter mixture over the salmon fillets.\n5. Slice the lemon and place a few slices on top of each fillet.\n6. Bake in the preheated oven for 12-15 minutes, or until the salmon is cooked through.\n7. Garnish with chopped fresh parsley before serving.\n",
    "\nRecipe: Mediterranean Salad\nIngredients: spinach, feta cheese, olives, cucumbers, cherry tomatoes, red onion, olive oil, lemon juice, salt, pepper\nInstructions:\n1. Wash and chop the spinach leaves.\n2. Cut the feta cheese into small cubes.\n3. Slice the olives and cucumbers.\n4. Halve the cherry tomatoes and thinly slice the red onion.\n5. In a large bowl, combine the spinach, feta cheese, olives, cucumbers, cherry tomatoes, and red onion.\n6. Drizzle olive oil and lemon juice over the salad.\n7. Season with salt and pepper to taste.\n8. Toss the salad gently to mix all the Ingredients well.\n9. Serve and enjoy!\n",
    "\nRecipe: Quinoa Black Bean Salad\nIngredients: quinoa, black beans, avocado, corn, red bell pepper, red onion, cilantro, lime, olive oil, salt, pepper\nInstructions:\n1. Cook quinoa according to package Instructions and let it cool.\n2. In a large bowl, combine cooked quinoa, drained and rinsed black beans, diced avocado, corn kernels, diced red bell pepper, diced red onion, and chopped cilantro.\n3. In a small bowl, whisk together the juice of a lime, olive oil, salt, and pepper.\n4. Pour the dressing over the salad and toss gently to combine.\n5. Adjust seasoning if needed and serve chilled.\n",
    "\nRecipe: Stir-Fried Tofu with Broccoli and Bell Peppers\nIngredients: tofu, broccoli, bell peppers, sesame oil, soy sauce, garlic, ginger, cornstarch, rice vinegar, brown sugar\nInstructions:\n1. Press tofu to remove excess water, then cut into cubes.\n2. In a small bowl, mix soy sauce, minced garlic, grated ginger, cornstarch, rice vinegar, and brown sugar to make the sauce.\n3. Heat sesame oil in a pan over medium-high heat.\n4. Add tofu cubes and cook until golden brown on all sides.\n5. Remove tofu from the pan and set aside.\n6. In the same pan, add more sesame oil if needed and stir-fry broccoli and bell peppers until slightly tender.\n7. Return tofu to the pan, pour the sauce over the tofu and vegetables, and stir well to coat.\n8. Cook for a few more minutes until the sauce thickens and everything is heated through.\n9. Serve hot over rice or noodles.\n",
    "\nRecipe: Shrimp and Pineapple Stir-Fry\nIngredients: shrimp, pineapple, bell peppers, onions, soy sauce, garlic, ginger, cornstarch, sesame oil, rice vinegar, brown sugar, green onions, cooked rice\nInstructions:\n1. In a small bowl, mix soy sauce, minced garlic, grated ginger, cornstarch, sesame oil, rice vinegar, and brown sugar. Set aside.\n2. Heat a large skillet or wok over medium-high heat. Add a bit of oil and saut sliced onions and bell peppers until slightly softened.\n3. Add shrimp to the skillet and cook until pink and opaque.\n4. Stir in diced pineapple and the sauce mixture. Cook for a few more minutes until the sauce thickens.\n5. Serve the stir-fry over cooked rice and garnish with sliced green onions.\n",
    "\nRecipe: Vanilla Cake\nIngredients: eggs, milk, flour, sugar, vanilla extract, butter, baking powder, salt\nInstructions:\n1. Preheat the oven to 350F (180C) and grease a cake pan.\n2. In a mixing bowl, cream together butter and sugar until light and fluffy.\n3. Add eggs one at a time, mixing well after each addition.\n4. Stir in vanilla extract.\n5. In a separate bowl, sift together flour, baking powder, and salt.\n6. Gradually add the dry Ingredients to the wet Ingredients, alternating with milk, until well combined.\n7. Pour the batter into the prepared cake pan and bake for 30-35 minutes, or until a toothpick inserted into the center comes out clean.\n8. Let the cake cool before serving. Enjoy!\n",
    "\nRecipe: Mediterranean Salad\nIngredients: spinach, feta cheese, olives, cucumbers, tomatoes, red onion, bell pepper, olive oil, lemon juice, salt, black pepper\nInstructions:\n1. Wash and chop the spinach, cucumbers, tomatoes, red onion, and bell pepper.\n2. In a large bowl, combine the chopped vegetables with crumbled feta cheese and sliced olives.\n3. In a small bowl, whisk together olive oil, lemon juice, salt, and black pepper to make the dressing.\n4. Pour the dressing over the salad and toss gently to combine.\n5. Serve the Mediterranean salad chilled and enjoy!\n",
    "\nRecipe: Quinoa Black Bean Salad\nIngredients: quinoa, black beans, corn, avocado, lime, red bell pepper, red onion, cilantro, olive oil, salt, pepper\nInstructions:\n1. Cook quinoa according to package Instructions and let it cool.\n2. In a large bowl, combine cooked quinoa, black beans, corn, diced avocado, diced red bell pepper, diced red onion, and chopped cilantro.\n3. In a small bowl, whisk together the juice of the lime, olive oil, salt, and pepper.\n4. Pour the dressing over the salad and toss to combine.\n5. Serve chilled and enjoy!\n",
    "\nRecipe: Coconut Chickpea Curry\nIngredients: chickpeas, curry powder, coconut milk, bell peppers, onion, garlic, ginger, tomatoes, spinach, salt, pepper, olive oil\nInstructions:\n1. Heat olive oil in a large pan over medium heat.\n2. Add chopped onion, minced garlic, and grated ginger. Cook until softened.\n3. Stir in curry powder and cook for another minute.\n4. Add diced bell peppers and cook for a few minutes.\n5. Pour in coconut milk and chopped tomatoes. Bring to a simmer.\n6. Add drained chickpeas and simmer for 10-15 minutes.\n7. Season with salt and pepper to taste.\n8. Stir in spinach and cook until wilted.\n9. Serve hot over rice or with naan bread.\n",
    "\nRecipe: Rice and Beans with Tomato Sauce\nIngredients: rice, beans, tomatoes, onion, garlic, bell pepper, cumin, paprika, salt, pepper, olive oil\nInstructions:\n1. Cook rice according to package Instructions.\n2. In a large skillet, heat olive oil over medium heat.\n3. Add chopped onion, garlic, and bell pepper. Cook until softened.\n4. Stir in cumin, paprika, salt, and pepper.\n5. Add diced tomatoes and cook for a few minutes.\n6. Add cooked beans and simmer for 10-15 minutes.\n7. Serve the rice topped with the beans and tomato sauce mixture.\n8. Enjoy your delicious Rice and Beans with Tomato Sauce!\n",
    "\nRecipe: Garlic Spinach Pasta\nIngredients: pasta, spinach, garlic, olive oil, salt, black pepper, parmesan cheese\nInstructions:\n1. Cook the pasta according to package Instructions until al dente.\n2. In a large skillet, heat olive oil over medium heat.\n3. Add minced garlic and saut until fragrant.\n4. Add spinach and cook until wilted.\n5. Season with salt and black pepper to taste.\n6. Add the cooked pasta to the skillet and toss to combine.\n7. Serve hot, garnished with grated parmesan cheese.\n",
    "\nRecipe: Grilled Salmon with Asparagus\nIngredients: salmon, asparagus, lemon, butter, salt, black pepper, olive oil\nInstructions:\n1. Preheat grill to medium-high heat.\n2. Season salmon with salt and black pepper.\n3. Drizzle olive oil over asparagus and season with salt.\n4. Place salmon and asparagus on the grill.\n5. Grill salmon for 4-5 minutes per side, or until cooked to your liking.\n6. Grill asparagus for 5-7 minutes, turning occasionally.\n7. Remove salmon and asparagus from the grill.\n8. Squeeze lemon juice over the salmon.\n9. Serve salmon and asparagus with a side of melted butter.\n10. Enjoy!\n",
    "\nRecipe: Tofu and Broccoli Stir-Fry\nIngredients: tofu, broccoli, soy sauce, ginger, garlic, vegetable oil, cornstarch, rice vinegar, sesame oil, green onions\nInstructions:\n1. Press tofu to remove excess water, then cut into cubes.\n2. In a small bowl, mix soy sauce, rice vinegar, cornstarch, and a splash of water to make the sauce.\n3. Heat vegetable oil in a pan over medium heat. Add tofu cubes and cook until golden brown on all sides. Remove from pan and set aside.\n4. In the same pan, add more oil if needed. Stir-fry minced garlic and grated ginger until fragrant.\n5. Add broccoli florets and cook until slightly tender.\n6. Return tofu to the pan, pour in the sauce, and stir well to coat everything.\n7. Cook for a few more minutes until the sauce thickens and coats the tofu and broccoli.\n8. Drizzle with sesame oil and garnish with sliced green onions before serving.\n9. Serve hot over steamed rice.\n",
    "\nRecipe: Quinoa Stuffed Bell Peppers\nIngredients: quinoa, bell peppers, corn, black beans, onion, garlic, tomato, cumin, paprika, salt, pepper, olive oil, cheese (optional), cilantro (optional)\nInstructions:\n1. Preheat the oven to 375F (190C).\n2. Cook quinoa according to package Instructions.\n3. Cut the tops off the bell peppers and remove seeds and membranes.\n4. In a skillet, heat olive oil over medium heat. Add chopped onion and minced garlic, cook until softened.\n5. Add diced tomatoes, corn, black beans, cooked quinoa, cumin, paprika, salt, and pepper. Cook for a few minutes until heated through.\n6. Stuff the bell peppers with the quinoa mixture and place them in a baking dish.\n7. Cover with foil and bake for 25-30 minutes, until peppers are tender.\n8. If desired, top with cheese and bake for an additional 5 minutes until melted.\n9. Garnish with chopped cilantro before serving.\n",
    "\nRecipe: Shrimp and Vegetable Pasta\nIngredients: shrimp, zucchini, mushrooms, pasta sauce, garlic, olive oil, salt, pepper, parsley, grated Parmesan cheese\nInstructions:\n1. Cook pasta according to package Instructions.\n2. In a large skillet, heat olive oil over medium heat.\n3. Add minced garlic and cook until fragrant.\n4. Add sliced zucchini and mushrooms, saut until tender.\n5. Add shrimp and cook until pink and opaque.\n6. Pour in pasta sauce and simmer for a few minutes.\n7. Season with salt, pepper, and chopped parsley.\n8. Serve the shrimp and vegetable mixture over cooked pasta.\n9. Garnish with grated Parmesan cheese before serving.\n",
    "\nRecipe: Pork and Cabbage Stir-Fry\nIngredients: pork, cabbage, soy sauce, sesame oil, garlic, ginger, green onions, cornstarch, rice vinegar\nInstructions:\n1. Slice the pork into thin strips and marinate in soy sauce and sesame oil.\n2. Heat a wok or large skillet over high heat and add sesame oil.\n3. Add minced garlic and ginger, then stir in the marinated pork until browned.\n4. Add sliced cabbage and cook until slightly softened.\n5. Mix cornstarch with water to create a slurry and pour into the wok to thicken the sauce.\n6. Drizzle with rice vinegar and stir in chopped green onions before serving.\n",
    "\nRecipe: Coconut Lentil Curry with Sweet Potatoes\nIngredients: 1 cup lentils, 2 sweet potatoes, peeled and diced, 1 can coconut milk, 2 tbsp curry powder, 1 onion, chopped, 2 cloves garlic, minced, 1 inch ginger, grated, 1 red bell pepper, diced, 1 can diced tomatoes, 2 cups vegetable broth, Salt and pepper to taste, Fresh cilantro for garnish\nInstructions:\n1. In a large pot, heat some oil over medium heat and saut the onion, garlic, and ginger until fragrant.\n2. Add the sweet potatoes, lentils, curry powder, and red bell pepper. Stir well to combine.\n3. Pour in the coconut milk, diced tomatoes, and vegetable broth. Season with salt and pepper.\n4. Bring the mixture to a boil, then reduce heat and let it simmer for about 20-25 minutes, or until the lentils and sweet potatoes are cooked through.\n5. Taste and adjust seasoning if needed.\n6. Serve the coconut lentil curry over rice or with naan bread, garnished with fresh cilantro.\n",
    "\nRecipe: Coconut Shrimp Curry\nIngredients: shrimp, coconut milk, curry paste, bell peppers, onion, garlic, ginger, chili peppers, cilantro, lime juice, salt, pepper\nInstructions:\n1. In a large skillet, heat some oil over medium heat.\n2. Add chopped onion, minced garlic, ginger, and chili peppers. Cook until fragrant.\n3. Stir in curry paste and cook for another minute.\n4. Add sliced bell peppers and cook until slightly softened.\n5. Pour in coconut milk and bring to a simmer.\n6. Add shrimp and cook until they turn pink and opaque.\n7. Season with salt, pepper, and lime juice to taste.\n8. Garnish with chopped cilantro before serving.\n9. Serve hot over rice or with naan bread.\n",
    "\nRecipe: Quinoa Black Bean Salad\nIngredients: quinoa, black beans, corn, avocado, cilantro, red bell pepper, red onion, lime, olive oil, salt, pepper\nInstructions:\n1. Cook quinoa according to package Instructions and let it cool.\n2. In a large bowl, combine cooked quinoa, black beans, corn, diced avocado, chopped cilantro, diced red bell pepper, and diced red onion.\n3. In a small bowl, whisk together lime juice, olive oil, salt, and pepper to make the dressing.\n4. Pour the dressing over the salad and toss gently to combine.\n5. Refrigerate for at least 30 minutes before serving to allow flavors to meld.\n6. Serve chilled and enjoy!\n",
    "\nRecipe: Tofu and Broccoli Stir-Fry\nIngredients: tofu, broccoli, soy sauce, ginger, sesame oil, garlic, cornstarch, vegetable broth, green onions\nInstructions:\n1. Press tofu to remove excess water, then cut into cubes.\n2. In a small bowl, mix soy sauce, minced ginger, minced garlic, and cornstarch to make a sauce.\n3. Heat sesame oil in a pan over medium heat, add tofu cubes and cook until golden brown.\n4. Remove tofu from the pan and set aside.\n5. In the same pan, add more sesame oil and stir-fry broccoli until tender-crisp.\n6. Add the tofu back to the pan, pour in the sauce, and stir to coat everything.\n7. Pour in vegetable broth and cook until the sauce thickens.\n8. Serve the stir-fry over rice, garnished with sliced green onions.\n",
    "\nRecipe: Bacon, Egg, and Cheese Breakfast Sandwich\nIngredients: eggs, bacon, bread, cheese, butter, salt, pepper\nInstructions:\n1. Cook the bacon in a skillet until crispy. Remove and set aside.\n2. In the same skillet, fry the eggs to your desired doneness. Season with salt and pepper.\n3. Toast the bread slices in a toaster or on a skillet with butter.\n4. Assemble the sandwich by placing the cooked bacon, fried eggs, and cheese between the toasted bread slices.\n5. Enjoy your delicious Bacon, Egg, and Cheese Breakfast Sandwich!\n",
    "\nRecipe: Teriyaki Shrimp Stir-Fry\nIngredients: shrimp, bell peppers, onions, pineapple, teriyaki sauce, garlic, ginger, soy sauce, cornstarch, vegetable oil, rice\nInstructions:\n1. In a small bowl, mix together teriyaki sauce, soy sauce, minced garlic, grated ginger, and cornstarch. Set aside.\n2. Heat vegetable oil in a large skillet or wok over medium-high heat.\n3. Add sliced onions and bell peppers to the skillet and stir-fry for 2-3 minutes until slightly softened.\n4. Add shrimp to the skillet and cook until they turn pink and opaque.\n5. Stir in the teriyaki sauce mixture and pineapple chunks. Cook for another 2-3 minutes until the sauce thickens and coats the Ingredients.\n6. Serve the teriyaki shrimp stir-fry over cooked rice. Enjoy!\n",
    "\nRecipe: Lemon Dill Baked Salmon\nIngredients: salmon, lemon, dill, olive oil, garlic, salt, black pepper\nInstructions:\n1. Preheat the oven to 400F (200C).\n2. In a small bowl, mix together chopped dill, minced garlic, olive oil, salt, and black pepper.\n3. Place the salmon fillets on a baking sheet lined with parchment paper.\n4. Squeeze lemon juice over the salmon fillets and season with salt and black pepper.\n5. Spread the dill mixture evenly over the salmon fillets.\n6. Bake in the preheated oven for 12-15 minutes, or until the salmon is cooked through and flakes easily with a fork.\n7. Serve the lemon dill baked salmon hot, garnished with additional fresh dill and lemon slices.\n",
    "\nRecipe: Tofu and Broccoli Stir-Fry\nIngredients: tofu, broccoli, soy sauce, garlic, vegetable oil, ginger, cornstarch, rice vinegar, sesame oil, green onions\nInstructions:\n1. Press tofu to remove excess water, then cut into cubes.\n2. In a small bowl, mix soy sauce, rice vinegar, cornstarch, and a splash of water to make a sauce.\n3. Heat vegetable oil in a pan over medium heat. Add garlic and ginger, cook until fragrant.\n4. Add tofu cubes and cook until golden brown on all sides.\n5. Add broccoli florets and stir-fry for a few minutes until slightly tender.\n6. Pour in the sauce and stir well to coat the tofu and broccoli.\n7. Cook for a few more minutes until the sauce thickens.\n8. Drizzle with sesame oil and garnish with chopped green onions before serving.\n",
    "\nRecipe: Sweet and Spicy Shrimp Stir-Fry\nIngredients: shrimp, bell peppers, onions, pineapple, soy sauce, garlic, ginger, chili flakes, sesame oil, cornstarch, rice vinegar, brown sugar\nInstructions:\n1. In a small bowl, mix together soy sauce, garlic, ginger, chili flakes, sesame oil, cornstarch, rice vinegar, and brown sugar to make the sauce.\n2. Heat some oil in a pan over medium-high heat.\n3. Add shrimp and stir-fry until pink and cooked through. Remove from pan and set aside.\n4. In the same pan, add more oil if needed and stir-fry bell peppers, onions, and pineapple until slightly tender.\n5. Return the shrimp to the pan and pour the sauce over the Ingredients.\n6. Stir well to coat everything in the sauce and cook for a few more minutes until heated through.\n7. Serve hot over rice or noodles. Enjoy!\n",
    "\nRecipe: Quinoa Black Bean Salad\nIngredients: quinoa, black beans, corn, avocado, red bell pepper, cherry tomatoes, red onion, cilantro, lime, olive oil, salt, pepper\nInstructions:\n1. Cook quinoa according to package Instructions and let it cool.\n2. In a large bowl, combine cooked quinoa, black beans, corn, diced avocado, diced red bell pepper, halved cherry tomatoes, diced red onion, and chopped cilantro.\n3. In a small bowl, whisk together the juice of a lime, olive oil, salt, and pepper to make the dressing.\n4. Pour the dressing over the salad and toss gently to combine.\n5. Serve chilled or at room temperature.\n",
    "\nRecipe: Apple Cinnamon Pork Chops\nIngredients: pork chops, apples, cinnamon, brown sugar, salt, pepper, butter, onion\nInstructions:\n1. Season pork chops with salt and pepper.\n2. In a skillet, melt butter over medium heat.\n3. Add pork chops and cook until browned on both sides, about 4-5 minutes per side.\n4. Remove pork chops from skillet and set aside.\n5. In the same skillet, add sliced apples, diced onion, cinnamon, and brown sugar.\n6. Cook until apples are tender and caramelized, about 5-7 minutes.\n7. Return pork chops to the skillet and spoon apple mixture over the top.\n8. Cover and simmer for an additional 5-10 minutes, or until pork chops are cooked through.\n9. Serve hot and enjoy!\n",
    "\nRecipe: Avocado Bacon Breakfast Sandwich\nIngredients: eggs, bacon, bread, avocado, cheese, mayonnaise, salt, pepper\nInstructions:\n1. Cook bacon in a skillet until crispy, then set aside on paper towels to drain.\n2. In the same skillet, fry eggs to desired doneness, seasoning with salt and pepper.\n3. Toast bread slices until golden brown.\n4. Spread mayonnaise on one side of each bread slice.\n5. Layer avocado slices on one bread slice, followed by bacon slices, fried egg, and cheese.\n6. Top with the remaining bread slice to form a sandwich.\n7. Cut in half and serve hot. Enjoy your Avocado Bacon Breakfast Sandwich!\n",
    "\nRecipe: Creamy Shrimp Pasta\nIngredients: shrimp, pasta, cream sauce, parmesan cheese, butter, garlic, salt, black pepper, parsley\nInstructions:\n1. Cook the pasta according to package Instructions.\n2. In a large skillet, melt butter over medium heat.\n3. Add minced garlic and cook until fragrant.\n4. Add shrimp and cook until pink and cooked through.\n5. Stir in cream sauce and bring to a simmer.\n6. Add cooked pasta to the skillet and toss to coat in the sauce.\n7. Season with salt and black pepper to taste.\n8. Sprinkle parmesan cheese and chopped parsley on top before serving.\n",
    "\nRecipe: Roasted Chickpeas with Lemon and Cumin\nIngredients: chickpeas, cumin, garlic powder, lemon juice, olive oil, salt, black pepper\nInstructions:\n1. Preheat the oven to 400F (200C).\n2. Rinse and drain a can of chickpeas, then pat them dry with a paper towel.\n3. In a bowl, toss the chickpeas with olive oil, cumin, garlic powder, salt, and black pepper until evenly coated.\n4. Spread the chickpeas in a single layer on a baking sheet.\n5. Roast in the oven for 25-30 minutes, shaking the pan halfway through, until the chickpeas are crispy and golden brown.\n6. Remove from the oven and drizzle with fresh lemon juice.\n7. Serve warm as a delicious and healthy snack or topping for salads.\n",
    "\nRecipe: Vegetable Roast\nIngredients: potatoes, onions, carrots, olive oil, salt, pepper, garlic powder, rosemary\nInstructions:\n1. Preheat the oven to 400F (200C).\n2. Wash and peel the potatoes, carrots, and onions. Cut them into chunks.\n3. Place the vegetables in a large baking dish.\n4. Drizzle with olive oil and sprinkle with salt, pepper, garlic powder, and rosemary. Toss to coat evenly.\n5. Roast in the preheated oven for about 30-40 minutes, or until the vegetables are tender and golden brown, stirring occasionally.\n6. Serve hot as a delicious side dish.\n",
    "\nRecipe: Beef and Bell Pepper Stir-Fry\nIngredients: beef, bell peppers, soy sauce, garlic, ginger, onion, cornstarch, vegetable oil, rice\nInstructions:\n1. Slice the beef into thin strips and marinate in soy sauce, garlic, and ginger for 30 minutes.\n2. Heat vegetable oil in a pan over high heat.\n3. Add sliced onion and bell peppers, stir-fry until slightly tender.\n4. Add marinated beef and stir-fry until cooked through.\n5. Mix cornstarch with water to create a slurry, then add to the pan to thicken the sauce.\n6. Serve the stir-fry over cooked rice.\n",
    "\nRecipe: Garlic Butter Shrimp\nIngredients: shrimp, garlic, butter, salt, black pepper, lemon juice, parsley\nInstructions:\n1. Peel and devein the shrimp.\n2. Mince the garlic and chop the parsley.\n3. In a skillet, melt butter over medium heat.\n4. Add minced garlic and cook until fragrant.\n5. Add the shrimp to the skillet and cook until pink and opaque.\n6. Season with salt, black pepper, and a squeeze of lemon juice.\n7. Sprinkle chopped parsley on top before serving.\n",
    "\nRecipe: Tofu and Broccoli Stir-Fry\nIngredients: tofu, broccoli, soy sauce, garlic, ginger, vegetable oil, cornstarch, rice vinegar, sesame oil, green onions\nInstructions:\n1. Press tofu to remove excess water, then cut into cubes.\n2. In a small bowl, mix soy sauce, rice vinegar, sesame oil, minced garlic, grated ginger, and cornstarch.\n3. Heat vegetable oil in a pan over medium-high heat.\n4. Add tofu cubes and cook until golden brown on all sides.\n5. Remove tofu from the pan and set aside.\n6. In the same pan, add more oil if needed and stir-fry broccoli until tender-crisp.\n7. Add the tofu back to the pan and pour the sauce over the tofu and broccoli.\n8. Cook for a few more minutes until the sauce thickens and coats the tofu and broccoli.\n9. Serve hot, garnished with sliced green onions.\n",
    "\nRecipe: Quinoa Black Bean Avocado Salad\nIngredients: quinoa, black beans, avocado, cherry tomatoes, red onion, cilantro, lime, olive oil, salt, pepper\nInstructions:\n1. Cook quinoa according to package Instructions and let it cool.\n2. In a large bowl, combine cooked quinoa, drained and rinsed black beans, diced avocado, halved cherry tomatoes, finely chopped red onion, and chopped cilantro.\n3. In a small bowl, whisk together the juice of a lime, olive oil, salt, and pepper.\n4. Pour the dressing over the salad and toss gently to combine.\n5. Serve chilled and enjoy!\n",
    "\nRecipe: Spinach and Feta Cheese Omelette\nIngredients: eggs, spinach, feta cheese, butter, salt, pepper\nInstructions:\n1. In a bowl, beat the eggs and season with salt and pepper.\n2. Heat butter in a non-stick pan over medium heat.\n3. Add the spinach to the pan and cook until wilted.\n4. Pour the beaten eggs over the spinach in the pan.\n5. Crumble feta cheese on top of the eggs.\n6. Cook until the eggs are set and the cheese is melted.\n7. Fold the omelette in half and serve hot.\n",
    "\nRecipe: Taco Beef Skillet\nIngredients: 1 lb ground beef, 1 onion, diced, 1 bell pepper, diced, 1 packet taco seasoning, 1 cup corn kernels, 1 can black beans, drained and rinsed, 1 cup salsa, 1 cup shredded cheddar cheese, Tortilla chips, for serving, Sour cream, for garnish, Fresh cilantro, for garnish\nInstructions:\n1. In a large skillet, cook the ground beef over medium heat until browned.\n2. Add the diced onion and bell pepper, and cook until softened.\n3. Stir in the taco seasoning, corn, black beans, and salsa. Cook for another 5 minutes.\n4. Sprinkle the shredded cheddar cheese on top and cover until melted.\n5. Serve the taco beef skillet with tortilla chips, sour cream, and fresh cilantro.\n",
    "\nRecipe: Ginger Garlic Tofu Stir-Fry\nIngredients: tofu, soy sauce, ginger, garlic, vegetable oil, bell peppers, onion, broccoli florets, cornstarch, sesame oil, green onions, cooked rice\nInstructions:\n1. Press tofu to remove excess water, then cut into cubes.\n2. In a bowl, mix soy sauce, minced ginger, and minced garlic. Add tofu cubes and marinate for 15-20 minutes.\n3. Heat vegetable oil in a pan over medium-high heat. Add marinated tofu cubes and cook until browned on all sides. Remove from pan and set aside.\n4. In the same pan, add sliced bell peppers, onion, and broccoli florets. Stir-fry until vegetables are tender-crisp.\n5. In a small bowl, mix cornstarch with water to create a slurry. Add to the pan along with the tofu.\n6. Drizzle with sesame oil and toss to combine. Cook for another 2-3 minutes until the sauce thickens.\n7. Garnish with sliced green onions and serve over cooked rice.\n",
    "\nRecipe: Sweet Potato and Black Bean Enchiladas\nIngredients: sweet potatoes, black beans, salsa, cheese, tortillas, onion, garlic, cumin, chili powder, lime, cilantro\nInstructions:\n1. Preheat the oven to 375F (190C).\n2. Peel and dice the sweet potatoes, then boil or steam until tender.\n3. In a skillet, saut diced onion and minced garlic until fragrant.\n4. Add the cooked sweet potatoes, black beans, cumin, chili powder, and salsa to the skillet. Cook for a few minutes to combine flavors.\n5. Squeeze in fresh lime juice and stir in chopped cilantro.\n6. Fill each tortilla with the sweet potato and black bean mixture, roll up, and place seam-side down in a baking dish.\n7. Top with additional salsa and cheese.\n8. Bake in the preheated oven for 20-25 minutes, until the enchiladas are heated through and the cheese is melted.\n9. Serve hot, garnished with extra cilantro and a squeeze of lime.\n",
    "\nRecipe: Mediterranean Chickpea Salad\nIngredients: chickpeas, cucumber, tomato, feta cheese, olives, red onion, lemon juice, olive oil, garlic, fresh parsley, salt, black pepper\nInstructions:\n1. Rinse and drain the chickpeas.\n2. Chop the cucumber, tomato, feta cheese, olives, and red onion into bite-sized pieces.\n3. In a large bowl, combine the chickpeas, cucumber, tomato, feta cheese, olives, and red onion.\n4. In a small bowl, whisk together lemon juice, olive oil, minced garlic, salt, and black pepper to make the dressing.\n5. Pour the dressing over the salad and toss gently to combine.\n6. Garnish with fresh parsley before serving.\n7. Enjoy your Mediterranean Chickpea Salad!\n",
    "\nRecipe: Sausage and Potato Skillet\nIngredients: potatoes, onions, bell peppers, sausage, olive oil, garlic, salt, pepper, paprika\nInstructions:\n1. Heat olive oil in a skillet over medium heat.\n2. Add sliced sausage and cook until browned.\n3. Add diced potatoes and cook until slightly browned and tender.\n4. Stir in chopped onions, bell peppers, and minced garlic.\n5. Season with salt, pepper, and paprika to taste.\n6. Cook until vegetables are tender and flavors are well combined.\n7. Serve hot and enjoy!\n",
    "\nRecipe: Beef Stew\nIngredients: beef, carrots, potatoes, onions, beef broth, garlic, celery, thyme, bay leaves, salt, pepper\nInstructions:\n1. Heat oil in a large pot over medium heat.\n2. Add diced onions and minced garlic, cook until fragrant.\n3. Add cubed beef, season with salt and pepper, and brown on all sides.\n4. Pour in beef broth and add chopped carrots, potatoes, and celery.\n5. Stir in thyme and add bay leaves for flavor.\n6. Cover and simmer on low heat for 5-2 hours, or until beef is tender.\n7. Adjust seasoning with salt and pepper before serving.\n",
    "\nRecipe: Creamy Shrimp Pasta\nIngredients: shrimp, pasta, cream sauce, parmesan cheese, garlic, butter, salt, black pepper, parsley\nInstructions:\n1. Cook the pasta according to package Instructions until al dente. Drain and set aside.\n2. In a large skillet, melt butter over medium heat. Add minced garlic and cook until fragrant.\n3. Add the shrimp to the skillet and cook until pink and cooked through.\n4. Pour in the cream sauce and bring to a simmer. Season with salt and black pepper to taste.\n5. Add the cooked pasta to the skillet and toss to coat in the sauce.\n6. Sprinkle parmesan cheese over the pasta and stir until melted and well combined.\n7. Serve the creamy shrimp pasta hot, garnished with chopped parsley.\n",
    "\nRecipe: Chicken Stir-Fry\nIngredients: rice, vegetables, soy sauce, chicken, garlic, ginger, sesame oil, cornstarch, green onions\nInstructions:\n1. Cook rice according to package Instructions.\n2. In a bowl, mix soy sauce, minced garlic, grated ginger, and cornstarch. Add chicken pieces and marinate for 15 minutes.\n3. Heat sesame oil in a pan over medium-high heat. Add marinated chicken and cook until browned.\n4. Add vegetables and stir-fry until tender-crisp.\n5. Pour in any remaining marinade and cook until sauce thickens.\n6. Serve the chicken stir-fry over cooked rice, garnished with sliced green onions.\n",
    "\nRecipe: Vanilla Butter Cake\nIngredients: flour, sugar, butter, eggs, vanilla extract, baking powder, salt, milk\nInstructions:\n1. Preheat the oven to 350F (180C) and grease a cake pan.\n2. In a bowl, cream together butter and sugar until light and fluffy.\n3. Add eggs one at a time, beating well after each addition. Stir in vanilla extract.\n4. In a separate bowl, combine flour, baking powder, and salt.\n5. Gradually add the dry Ingredients to the wet mixture, alternating with milk, until well combined.\n6. Pour the batter into the prepared cake pan and bake for 30-35 minutes or until a toothpick inserted into the center comes out clean.\n7. Let the cake cool before serving. Enjoy!\n",
    "\nRecipe: Beef and Bell Pepper Tacos\nIngredients: 1 lb ground beef, 1 onion, diced, 1 bell pepper, sliced, 1 packet taco seasoning, 8 tortillas, 1 cup shredded cheese, 1/2 cup salsa, 1/4 cup sour cream, 1 avocado, sliced, 1 lime, cut into wedges\nInstructions:\n1. In a large skillet, cook the ground beef over medium heat until browned. Add the diced onion and sliced bell pepper, and cook until vegetables are tender.\n2. Stir in the taco seasoning and cook for an additional 2 minutes.\n3. Warm the tortillas in a separate skillet or microwave.\n4. To assemble the tacos, spoon the beef mixture onto each tortilla. Top with shredded cheese, salsa, sour cream, avocado slices, and a squeeze of lime juice.\n5. Serve hot and enjoy!\n",
    "\nRecipe: Lemon Dill Salmon\nIngredients: salmon, lemon, dill, garlic, olive oil, salt, black pepper\nInstructions:\n1. Preheat the oven to 400F (200C).\n2. Place the salmon fillets on a baking sheet lined with parchment paper.\n3. Drizzle olive oil over the salmon fillets and season with salt and black pepper.\n4. Rub minced garlic over the salmon fillets.\n5. Slice the lemon and place a few lemon slices on top of each salmon fillet.\n6. Sprinkle chopped dill over the salmon fillets.\n7. Bake in the preheated oven for 12-15 minutes, or until the salmon is cooked through and flakes easily with a fork.\n8. Serve the lemon dill salmon hot with additional lemon slices on the side.\n",
    "\nRecipe: Loaded Baked Potatoes\nIngredients: potatoes, bacon, cheddar cheese, sour cream, chives, butter, salt, pepper\nInstructions:\n1. Preheat the oven to 400F (200C).\n2. Wash and scrub the potatoes, then pierce them with a fork a few times.\n3. Rub the potatoes with olive oil, sprinkle with salt, and place them on a baking sheet.\n4. Bake the potatoes for about 45-60 minutes, or until they are tender when pierced with a fork.\n5. While the potatoes are baking, cook the bacon until crispy, then crumble it.\n6. Once the potatoes are done, slice them open and fluff the insides with a fork.\n7. Top each potato with butter, cheddar cheese, bacon, and a dollop of sour cream.\n8. Season with salt, pepper, and garnish with chopped chives.\n9. Serve hot and enjoy!\n",
    "\nRecipe: Chickpea Salad with Feta Cheese\nIngredients: chickpeas, cucumber, tomato, red onion, feta cheese, olive oil, lemon juice, salt, black pepper, fresh parsley\nInstructions:\n1. Rinse and drain the chickpeas.\n2. Chop the cucumber, tomato, and red onion into bite-sized pieces.\n3. In a large bowl, combine the chickpeas, cucumber, tomato, red onion, and crumbled feta cheese.\n4. Drizzle with olive oil and lemon juice, then season with salt and black pepper. Toss to combine.\n5. Garnish with fresh parsley before serving.\n",
    "\nRecipe: Quinoa Salad with Spinach, Avocado, and Cherry Tomatoes\nIngredients: quinoa, spinach, avocado, cherry tomatoes, red onion, cucumber, feta cheese, olive oil, lemon juice, salt, pepper\nInstructions:\n1. Cook quinoa according to package Instructions and let it cool.\n2. Chop spinach, avocado, cherry tomatoes, red onion, and cucumber.\n3. In a large bowl, combine the cooked quinoa, chopped vegetables, and crumbled feta cheese.\n4. Drizzle with olive oil and lemon juice, and season with salt and pepper.\n5. Toss everything together until well combined.\n6. Serve chilled and enjoy!\n",
    "\nRecipe: Classic BLT Sandwich\nIngredients: eggs, bacon, bread, lettuce, tomato, mayonnaise\nInstructions:\n1. Cook the bacon in a skillet until crispy.\n2. Toast the bread slices.\n3. Spread mayonnaise on one side of each bread slice.\n4. Layer lettuce, tomato slices, cooked bacon, and fried eggs on one bread slice.\n5. Top with the other bread slice to make a sandwich.\n6. Cut the sandwich in half and serve.\n",
    "\nRecipe: Shrimp Stir-Fry\nIngredients: shrimp, bell peppers, zucchini, olive oil, soy sauce, garlic, ginger, cornstarch, sesame oil, green onions\nInstructions:\n1. In a bowl, mix soy sauce, minced garlic, grated ginger, and cornstarch. Add shrimp and let it marinate for 15 minutes.\n2. Heat olive oil in a pan over medium-high heat. Add sliced bell peppers and zucchini, stir-fry for 3-4 minutes.\n3. Add marinated shrimp to the pan and cook until shrimp turns pink and opaque.\n4. Drizzle with sesame oil and garnish with chopped green onions before serving.\n",
    "\nRecipe: Vegetarian Chili\nIngredients: mushrooms, onions, bell peppers, chili powder, black beans, garlic, diced tomatoes, vegetable broth, corn, cumin, paprika, salt, pepper\nInstructions:\n1. In a large pot, saut onions, bell peppers, and garlic until softened.\n2. Add mushrooms and cook until they release their juices.\n3. Stir in chili powder, cumin, paprika, salt, and pepper.\n4. Add black beans, diced tomatoes, corn, and vegetable broth.\n5. Simmer for 20-30 minutes, stirring occasionally.\n6. Adjust seasoning to taste.\n7. Serve hot and enjoy!\n",
    "\nRecipe: Lemon Garlic Dill Salmon\nIngredients: salmon, lemon, garlic, dill, olive oil, salt, black pepper\nInstructions:\n1. Preheat the oven to 400F (200C).\n2. Place the salmon fillets on a baking sheet lined with parchment paper.\n3. Drizzle olive oil over the salmon fillets and season with salt and black pepper.\n4. Squeeze fresh lemon juice over the salmon and sprinkle minced garlic and chopped dill on top.\n5. Bake in the preheated oven for 12-15 minutes, or until the salmon is cooked through and flakes easily with a fork.\n6. Serve hot with additional lemon wedges on the side.\n",
    "\nRecipe: Spinach and Feta Stuffed Chicken\nIngredients: spinach, feta cheese, olives, chicken breasts, garlic, salt, pepper, olive oil\nInstructions:\n1. Preheat the oven to 375F (190C).\n2. In a bowl, mix together chopped spinach, crumbled feta cheese, chopped olives, minced garlic, salt, and pepper.\n3. Cut a pocket into each chicken breast and stuff with the spinach and feta mixture.\n4. Season the outside of the chicken breasts with salt and pepper.\n5. Heat olive oil in a skillet over medium-high heat.\n6. Sear the stuffed chicken breasts until golden brown on both sides.\n7. Transfer the chicken to a baking dish and bake in the preheated oven for 25-30 minutes or until the chicken is cooked through.\n8. Serve hot and enjoy!\n",
    "\nRecipe: Cheesy Tomato Pasta\nIngredients: pasta, tomatoes, cheese, olive oil, garlic, salt, pepper, basil\nInstructions:\n1. Cook the pasta according to package Instructions.\n2. In a pan, heat olive oil and saut minced garlic until fragrant.\n3. Add chopped tomatoes and cook until they soften.\n4. Season with salt, pepper, and fresh basil.\n5. Mix in cooked pasta and grated cheese, stirring until cheese melts and coats the pasta.\n6. Serve hot and enjoy!\n",
    "\nRecipe: Rice and Beans Stir-Fry\nIngredients: rice, beans, onions, bell peppers, garlic, soy sauce, sesame oil, salt, pepper\nInstructions:\n1. Cook rice according to package Instructions.\n2. In a large skillet, heat sesame oil over medium heat.\n3. Add chopped onions, bell peppers, and minced garlic. Cook until vegetables are tender.\n4. Add cooked rice and beans to the skillet. Stir well to combine.\n5. Season with soy sauce, salt, and pepper. Cook for an additional 5 minutes, stirring occasionally.\n6. Serve hot and enjoy!\n",
    "\nRecipe: Beef Stew\nIngredients: potatoes, carrots, onions, beef, beef broth, garlic, thyme, salt, pepper\nInstructions:\n1. In a large pot, heat some oil over medium heat.\n2. Add chopped onions and minced garlic, cook until fragrant.\n3. Add cubed beef and brown on all sides.\n4. Pour in beef broth and add chopped potatoes and carrots.\n5. Season with thyme, salt, and pepper.\n6. Cover and simmer for about 5 hours, or until beef is tender.\n7. Serve hot and enjoy!\n",
    "\nRecipe: Shrimp and Avocado Ceviche\nIngredients: shrimp, avocado, lime, cilantro, red onion, tomato, jalapeno, salt, pepper\nInstructions:\n1. Cook the shrimp in boiling water until pink and cooked through. Drain and let cool.\n2. Chop the shrimp into bite-sized pieces and place in a large bowl.\n3. Dice the avocado, red onion, tomato, and jalapeno. Add them to the bowl with the shrimp.\n4. Finely chop the cilantro and add it to the bowl.\n5. Squeeze the lime juice over the mixture and season with salt and pepper. Mix well to combine.\n6. Cover and refrigerate for at least 30 minutes to allow the flavors to meld together.\n7. Serve the shrimp and avocado ceviche chilled, garnished with additional cilantro leaves and lime wedges.\n",
    "\nRecipe: Quinoa Black Bean Salad\nIngredients: quinoa, black beans, corn, bell peppers, red onion, cherry tomatoes, avocado, cilantro, lime, olive oil, salt, pepper\nInstructions:\n1. Cook quinoa according to package Instructions and let it cool.\n2. In a large bowl, combine cooked quinoa, black beans, corn, diced bell peppers, diced red onion, halved cherry tomatoes, diced avocado, and chopped cilantro.\n3. In a small bowl, whisk together the juice of a lime, olive oil, salt, and pepper to make the dressing.\n4. Pour the dressing over the salad and toss gently to combine.\n5. Serve chilled and enjoy!\n",
    "\nRecipe: Grilled Shrimp and Vegetable Skewers with Pineapple\nIngredients: shrimp, bell peppers, zucchini, pineapple, olive oil, garlic, salt, black pepper, lemon juice\nInstructions:\n1. Soak wooden skewers in water for 30 minutes.\n2. Preheat grill to medium-high heat.\n3. In a bowl, mix olive oil, minced garlic, salt, black pepper, and lemon juice.\n4. Thread shrimp, bell peppers, zucchini, and pineapple onto skewers.\n5. Brush the skewers with the olive oil mixture.\n6. Grill skewers for 2-3 minutes per side, or until shrimp is cooked through and vegetables are tender.\n7. Serve hot and enjoy!\n",
    "\nRecipe: Ginger Soy Tofu Stir-Fry\nIngredients: tofu, soy sauce, ginger, broccoli, garlic, sesame oil, cornstarch, vegetable broth, green onions, red bell pepper, carrots\nInstructions:\n1. Press tofu to remove excess water, then cut into cubes.\n2. In a small bowl, mix soy sauce, minced ginger, minced garlic, and cornstarch to make a marinade.\n3. Marinate tofu in the sauce for at least 30 minutes.\n4. Heat sesame oil in a pan over medium heat.\n5. Add marinated tofu and cook until browned on all sides.\n6. Remove tofu from the pan and set aside.\n7. In the same pan, add more sesame oil and stir-fry broccoli, sliced carrots, sliced red bell pepper, and chopped green onions.\n8. Once vegetables are tender, add vegetable broth and the remaining marinade.\n9. Bring to a simmer and add the cooked tofu back to the pan.\n10. Stir well to coat everything in the sauce.\n11. Serve hot over rice or noodles.\n",
    "\nRecipe: Tomato and Onion Pasta\nIngredients: tomatoes, onions, garlic, pasta, olive oil, salt, pepper\nInstructions:\n1. Cook the pasta according to package Instructions.\n2. In a pan, heat olive oil over medium heat.\n3. Add chopped onions and minced garlic, saut until fragrant.\n4. Add diced tomatoes, salt, and pepper. Cook until tomatoes are soft.\n5. Toss the cooked pasta with the tomato and onion mixture.\n6. Serve hot and enjoy!\n",
    "\nRecipe: Creamy Spinach and Mushroom Pasta\nIngredients: pasta, spinach, mushrooms, butter, garlic, heavy cream, parmesan cheese, salt, pepper\nInstructions:\n1. Cook the pasta according to package Instructions.\n2. In a large skillet, melt butter over medium heat. Add minced garlic and saut until fragrant.\n3. Add sliced mushrooms and cook until they release their juices and start to brown.\n4. Stir in the spinach and cook until wilted.\n5. Pour in the heavy cream and bring to a simmer. Cook for a few minutes until slightly thickened.\n6. Add cooked pasta to the skillet and toss to coat in the creamy sauce.\n7. Stir in grated parmesan cheese and season with salt and pepper to taste.\n8. Serve hot and enjoy!\n",
    "\nRecipe: Beef Stew\nIngredients: beef, potatoes, carrots, peas, onion, garlic, beef broth, tomato paste, bay leaves, salt, pepper\nInstructions:\n1. In a large pot, brown the beef over medium-high heat.\n2. Add chopped onion and minced garlic, cook until fragrant.\n3. Stir in diced potatoes, carrots, and peas.\n4. Pour in beef broth and tomato paste, add bay leaves, salt, and pepper.\n5. Bring to a boil, then reduce heat and simmer for 1-2 hours until beef is tender.\n6. Remove bay leaves before serving. Enjoy!\n",
    "\nRecipe: Grilled Salmon with Asparagus and Lemon\nIngredients: salmon, asparagus, lemon, olive oil, salt, black pepper\nInstructions:\n1. Preheat grill to medium-high heat.\n2. Season salmon with salt, black pepper, and a drizzle of olive oil.\n3. Cut the lemon into slices.\n4. Place the seasoned salmon and lemon slices on the grill, cook for about 4-5 minutes per side or until the salmon is cooked through.\n5. While the salmon is cooking, toss asparagus with olive oil, salt, and black pepper.\n6. Add the seasoned asparagus to the grill and cook for about 3-4 minutes, turning occasionally until tender.\n7. Serve the grilled salmon with asparagus and lemon slices on the side. Enjoy!\n",
    "\nRecipe: Shrimp Stir-Fry\nIngredients: shrimp, zucchini, bell peppers, onions, soy sauce, garlic, ginger, sesame oil, cornstarch, rice vinegar\nInstructions:\n1. In a bowl, mix together soy sauce, minced garlic, grated ginger, sesame oil, cornstarch, and rice vinegar to make the sauce.\n2. Heat a wok or large skillet over high heat. Add some oil and stir-fry the shrimp until pink and cooked through. Remove from the pan and set aside.\n3. In the same pan, stir-fry the sliced onions, bell peppers, and zucchini until slightly tender.\n4. Add the shrimp back to the pan and pour the sauce over the Ingredients. Stir well to coat everything in the sauce and cook for a few more minutes.\n5. Serve the shrimp stir-fry hot over steamed rice or noodles. Enjoy!\n",
    "\nRecipe: Pork Stir-Fry with Cabbage and Carrots\nIngredients: pork, cabbage, carrots, ginger, soy sauce, garlic, onion, bell pepper, cornstarch, vegetable oil, rice vinegar, sesame oil, green onions, red pepper flakes\nInstructions:\n1. Slice the pork into thin strips and marinate with soy sauce, rice vinegar, and cornstarch.\n2. Heat vegetable oil in a pan over high heat.\n3. Add minced garlic, ginger, and sliced onion. Stir-fry until fragrant.\n4. Add the marinated pork and cook until browned.\n5. Add sliced carrots, cabbage, and bell pepper. Stir-fry until vegetables are tender-crisp.\n6. Season with soy sauce, sesame oil, and red pepper flakes.\n7. Garnish with chopped green onions before serving.\n",
    "\nRecipe: Beef Stew\nIngredients: beef, potatoes, carrots, onion, garlic, beef broth, tomato paste, bay leaves, salt, pepper\nInstructions:\n1. In a large pot, heat some oil over medium heat.\n2. Add chopped onion and minced garlic, saut until fragrant.\n3. Add cubed beef and brown on all sides.\n4. Stir in tomato paste and cook for a few minutes.\n5. Add beef broth, bay leaves, salt, and pepper. Bring to a simmer.\n6. Add chopped potatoes and carrots, cover and cook until vegetables are tender.\n7. Adjust seasoning if needed.\n8. Serve hot and enjoy!\n",
    "\nRecipe: Tofu and Broccoli Stir-Fry\nIngredients: tofu, broccoli, sesame oil, soy sauce, garlic, ginger, cornstarch, rice vinegar, brown sugar\nInstructions:\n1. Press tofu to remove excess water, then cut into cubes.\n2. In a small bowl, mix soy sauce, minced garlic, grated ginger, cornstarch, rice vinegar, and brown sugar to make the sauce.\n3. Heat sesame oil in a pan over medium heat.\n4. Add tofu cubes and cook until golden brown on all sides.\n5. Remove tofu from the pan and set aside.\n6. In the same pan, add more sesame oil and stir-fry broccoli until tender-crisp.\n7. Return tofu to the pan, pour the sauce over the tofu and broccoli, and stir well to coat.\n8. Cook for a few more minutes until the sauce thickens and everything is heated through.\n9. Serve hot over rice or noodles.\n",
    "\nRecipe: Quinoa Black Bean Avocado Salad\nIngredients: quinoa, black beans, avocado, cherry tomatoes, red onion, cilantro, lime, olive oil, salt, pepper\nInstructions:\n1. Cook quinoa according to package Instructions and let it cool.\n2. Rinse and drain black beans.\n3. Chop avocado, cherry tomatoes, red onion, and cilantro.\n4. In a large bowl, combine quinoa, black beans, avocado, cherry tomatoes, red onion, and cilantro.\n5. In a small bowl, whisk together lime juice, olive oil, salt, and pepper to make the dressing.\n6. Pour the dressing over the salad and toss gently to combine.\n7. Serve chilled and enjoy!\n",
    "\nRecipe: Pork Stir-Fry\nIngredients: pork, onion, bell pepper, soy sauce, garlic, ginger, cornstarch, vegetable oil\nInstructions:\n1. Slice the pork into thin strips and marinate in soy sauce, garlic, and ginger for 30 minutes.\n2. Heat vegetable oil in a pan over high heat.\n3. Add the marinated pork and stir-fry until browned.\n4. Add sliced onion and bell pepper, and continue to stir-fry until vegetables are tender-crisp.\n5. Mix cornstarch with water to create a slurry, then pour over the stir-fry to thicken the sauce.\n6. Serve hot over rice or noodles.\n",
    "\nRecipe: Ginger Tofu Stir-Fry\nIngredients: tofu, soy sauce, ginger, vegetables, garlic, onion, bell pepper, carrots, broccoli, cornstarch, sesame oil\nInstructions:\n1. Press tofu to remove excess water, then cut into cubes.\n2. In a bowl, mix soy sauce, minced ginger, and cornstarch. Add tofu cubes and marinate for 15 minutes.\n3. Heat sesame oil in a pan over medium heat. Add minced garlic and sliced onion, cook until fragrant.\n4. Add marinated tofu cubes and stir-fry until golden brown.\n5. Add sliced bell pepper, julienned carrots, broccoli florets, and any other vegetables of your choice. Stir-fry until vegetables are tender-crisp.\n6. Season with additional soy sauce if needed. Serve hot over rice or noodles.\n",
    "\nRecipe: Quinoa Avocado Salad\nIngredients: quinoa, avocado, black beans, corn, cherry tomatoes, red onion, cilantro, lime, olive oil, salt, pepper\nInstructions:\n1. Cook quinoa according to package Instructions and let it cool.\n2. In a large bowl, combine cooked quinoa, diced avocado, drained and rinsed black beans, corn kernels, halved cherry tomatoes, diced red onion, and chopped cilantro.\n3. In a small bowl, whisk together the juice of a lime, olive oil, salt, and pepper to make the dressing.\n4. Pour the dressing over the salad and toss gently to combine.\n5. Serve chilled and enjoy!\n",
    "\nRecipe: Apple Cinnamon Crumble\nIngredients: apples, cinnamon, sugar, flour, butter, oats, brown sugar\nInstructions:\n1. Preheat the oven to 350F (175C).\n2. Peel and slice the apples, then place them in a baking dish.\n3. In a bowl, mix together flour, sugar, cinnamon, oats, and brown sugar.\n4. Cut in the butter until the mixture resembles coarse crumbs.\n5. Sprinkle the crumble mixture over the apples in the baking dish.\n6. Bake for 30-35 minutes or until the topping is golden brown and the apples are tender.\n7. Serve warm with ice cream or whipped cream.\n",
    "\nRecipe: Garlic Lemon Salmon\nIngredients: salmon, lemon, garlic, olive oil, salt, black pepper\nInstructions:\n1. Preheat the oven to 400F (200C).\n2. Place the salmon fillets on a baking sheet lined with parchment paper.\n3. Drizzle olive oil over the salmon fillets and season with salt and black pepper.\n4. Squeeze lemon juice over the salmon fillets and place lemon slices on top.\n5. Mince the garlic and sprinkle it over the salmon fillets.\n6. Bake in the preheated oven for 12-15 minutes, or until the salmon is cooked through.\n7. Serve the garlic lemon salmon hot with your favorite side dishes. Enjoy!\n",
    "\nRecipe: Shrimp Stir-Fry\nIngredients: shrimp, bell peppers, onions, soy sauce, garlic, ginger, sesame oil, cornstarch, sugar, vegetable oil\nInstructions:\n1. In a small bowl, mix together soy sauce, garlic, ginger, sesame oil, cornstarch, and sugar to make the sauce.\n2. Heat vegetable oil in a large pan over medium-high heat.\n3. Add onions and bell peppers to the pan and stir-fry for 2-3 minutes until slightly softened.\n4. Add shrimp to the pan and cook until they turn pink and opaque, about 2-3 minutes.\n5. Pour the sauce over the shrimp and vegetables in the pan, stirring to coat everything evenly.\n6. Cook for an additional 1-2 minutes until the sauce thickens and coats the shrimp and vegetables.\n7. Serve hot over rice or noodles. Enjoy!\n",
    "\nRecipe: Pork and Cabbage Stir-Fry\nIngredients: pork, cabbage, ginger, soy sauce, garlic, sesame oil, cornstarch, green onions\nInstructions:\n1. Slice the pork into thin strips and marinate with soy sauce, minced garlic, and grated ginger for 30 minutes.\n2. Heat sesame oil in a pan over medium-high heat.\n3. Add the marinated pork and stir-fry until cooked through.\n4. Add sliced cabbage and continue to stir-fry until slightly wilted.\n5. In a small bowl, mix cornstarch with water to create a slurry.\n6. Pour the cornstarch slurry into the pan and stir well to thicken the sauce.\n7. Garnish with chopped green onions before serving.\n8. Enjoy your delicious Pork and Cabbage Stir-Fry!\n",
    "\nRecipe: Creamy Shrimp and Spinach Pasta\nIngredients: shrimp, pasta, spinach, cream sauce, garlic, butter, salt, pepper, parmesan cheese\nInstructions:\n1. Cook pasta according to package Instructions.\n2. In a large skillet, melt butter over medium heat. Add minced garlic and cook until fragrant.\n3. Add shrimp to the skillet and cook until pink and cooked through.\n4. Stir in cream sauce and spinach, cooking until spinach is wilted.\n5. Season with salt and pepper to taste.\n6. Add cooked pasta to the skillet and toss to combine.\n7. Serve hot, garnished with grated parmesan cheese.\n",
    "\nRecipe: Beef Stew\nIngredients: potatoes, carrots, onion, beef broth, rosemary, beef chuck roast, garlic, salt, pepper, olive oil, flour\nInstructions:\n1. Cut the beef chuck roast into cubes and season with salt and pepper.\n2. In a large pot, heat olive oil over medium-high heat and brown the beef cubes on all sides. Remove and set aside.\n3. Add chopped onion and minced garlic to the pot, saut until fragrant.\n4. Return the beef to the pot and sprinkle flour over the mixture, stirring to coat the beef.\n5. Pour in the beef broth and add chopped potatoes, carrots, and rosemary.\n6. Bring to a boil, then reduce heat to low, cover, and simmer for about 5 to 2 hours or until the beef is tender.\n7. Season with additional salt and pepper to taste before serving.\n",
    "\nRecipe: Chicken Stir-Fry\nIngredients: chicken, soy sauce, vegetables (bell peppers, broccoli, carrots), garlic, ginger, cornstarch, oil, salt, pepper\nInstructions:\n1. Cut the chicken into bite-sized pieces.\n2. In a bowl, mix soy sauce, minced garlic, grated ginger, cornstarch, salt, and pepper. Add the chicken pieces and marinate for 15-20 minutes.\n3. Heat oil in a pan over medium-high heat. Add the marinated chicken and cook until browned and cooked through.\n4. Add the chopped vegetables and stir-fry for a few minutes until they are tender-crisp.\n5. Serve hot and enjoy!\n",
    "\nRecipe: Tomato Basil Pasta\nIngredients: pasta, tomatoes, basil, olive oil, garlic, salt, pepper, parmesan cheese\nInstructions:\n1. Cook the pasta according to package Instructions until al dente.\n2. In a separate pan, heat olive oil over medium heat and saut minced garlic until fragrant.\n3. Add chopped tomatoes to the pan and cook until they start to soften.\n4. Season with salt and pepper to taste.\n5. Add cooked pasta to the pan and toss to combine with the tomato mixture.\n6. Remove from heat and stir in chopped basil leaves.\n7. Serve hot, garnished with grated parmesan cheese.\n",
    "\nRecipe: Cheesy Spinach and Mushroom Omelette\nIngredients: eggs, cheese, spinach, mushrooms, butter, salt, pepper\nInstructions:\n1. In a bowl, beat the eggs and season with salt and pepper.\n2. Heat butter in a pan over medium heat.\n3. Add mushrooms and cook until they start to brown.\n4. Add spinach and cook until wilted.\n5. Pour the beaten eggs over the vegetables in the pan.\n6. Sprinkle cheese on top of the eggs.\n7. Cook until the eggs are set and the cheese is melted.\n8. Fold the omelette in half and serve hot.\n",
    "\nRecipe: Vegetable Tofu Stir-Fry\nIngredients: rice, soy sauce, vegetables, tofu, garlic, ginger, sesame oil, cornstarch, vegetable broth, green onions\nInstructions:\n1. Cook rice according to package Instructions.\n2. In a small bowl, mix soy sauce, minced garlic, grated ginger, sesame oil, and cornstarch to make the sauce.\n3. Cut tofu into cubes and stir-fry in a pan until golden brown. Set aside.\n4. Stir-fry mixed vegetables in the same pan until tender.\n5. Add the tofu back to the pan and pour the sauce over the tofu and vegetables.\n6. Add vegetable broth and cook until the sauce thickens.\n7. Serve the stir-fry over cooked rice and garnish with chopped green onions.\n",
    "\nRecipe: Beef Stew\nIngredients: beef, potatoes, carrots, onions, garlic, beef broth, tomato paste, bay leaves, salt, pepper\nInstructions:\n1. In a large pot, brown the beef over medium-high heat.\n2. Add the onions and garlic, cook until fragrant.\n3. Stir in the tomato paste and cook for a few minutes.\n4. Add the potatoes, carrots, beef broth, bay leaves, salt, and pepper.\n5. Bring to a boil, then reduce heat and simmer for about 5 hours or until beef is tender.\n6. Remove bay leaves before serving. Enjoy!\n",
    "\nRecipe: Baked Lemon Dill Salmon with Asparagus\nIngredients: salmon, lemon, dill, asparagus, olive oil, salt, black pepper, garlic powder\nInstructions:\n1. Preheat the oven to 400F (200C).\n2. Place the salmon fillets on a baking sheet lined with parchment paper.\n3. Drizzle olive oil over the salmon fillets and season with salt, black pepper, and garlic powder.\n4. Slice the lemon and place a few slices on top of each salmon fillet.\n5. Sprinkle dill over the salmon fillets.\n6. Arrange the asparagus spears around the salmon on the baking sheet.\n7. Drizzle olive oil over the asparagus and season with salt and black pepper.\n8. Bake in the preheated oven for 12-15 minutes, or until the salmon is cooked through and the asparagus is tender.\n9. Serve the baked lemon dill salmon with asparagus hot and enjoy!\n",
    "\nRecipe: Quinoa Black Bean Salad\nIngredients: quinoa, black beans, corn, avocado, cilantro, red bell pepper, red onion, lime, olive oil, salt, pepper\nInstructions:\n1. Cook quinoa according to package Instructions and let it cool.\n2. In a large bowl, combine cooked quinoa, black beans, corn, diced avocado, chopped cilantro, diced red bell pepper, and diced red onion.\n3. In a small bowl, whisk together the juice of 1 lime, 2 tablespoons of olive oil, salt, and pepper.\n4. Pour the dressing over the quinoa mixture and toss to combine.\n5. Adjust seasoning if needed and serve chilled.\n",
    "\nRecipe: Pork with Apple Sage Sauce and Sweet Potato Mash\nIngredients: pork chops, apples, sage leaves, sweet potatoes, butter, onion, garlic, chicken broth, salt, pepper\nInstructions:\n1. Season pork chops with salt and pepper.\n2. In a skillet, sear the pork chops until browned on both sides. Remove from skillet and set aside.\n3. In the same skillet, add butter, diced onion, and minced garlic. Cook until onion is translucent.\n4. Add chopped apples and sage leaves to the skillet. Cook until apples are slightly softened.\n5. Pour in chicken broth and bring to a simmer. Add the pork chops back to the skillet and cook until pork is cooked through.\n6. Meanwhile, peel and dice sweet potatoes. Boil in a pot of water until tender. Drain and mash with butter, salt, and pepper.\n7. Serve the pork chops with the apple sage sauce over the top, accompanied by the sweet potato mash.\n",
    "\nRecipe: Grilled Shrimp and Veggie Skewers\nIngredients: shrimp, bell peppers, zucchini, pineapple, olive oil, garlic, salt, pepper\nInstructions:\n1. Soak wooden skewers in water for 30 minutes.\n2. Preheat grill to medium-high heat.\n3. In a bowl, mix olive oil, minced garlic, salt, and pepper.\n4. Thread shrimp, bell peppers, zucchini, and pineapple onto skewers.\n5. Brush skewers with the olive oil mixture.\n6. Grill skewers for 2-3 minutes per side, or until shrimp is cooked through and veggies are tender.\n7. Serve hot and enjoy!\n",
    "\nRecipe: Coconut Lentil Curry with Sweet Potatoes\nIngredients: 1 cup lentils, 1 can coconut milk, 2 tbsp curry powder, 2 sweet potatoes, diced, 1 onion, chopped, 3 cloves garlic, minced, 1 inch ginger, grated, 1 can diced tomatoes, 2 cups vegetable broth, 1 tsp cumin, 1 tsp turmeric, Salt and pepper to taste, Fresh cilantro for garnish\nInstructions:\n1. In a large pot, heat some oil over medium heat and saut the onion, garlic, and ginger until fragrant.\n2. Add the curry powder, cumin, and turmeric, and cook for another minute.\n3. Stir in the lentils, sweet potatoes, diced tomatoes, coconut milk, and vegetable broth.\n4. Bring the mixture to a boil, then reduce heat and let simmer for about 20-25 minutes, or until the lentils and sweet potatoes are tender.\n5. Season with salt and pepper to taste.\n6. Serve the curry over rice or with naan bread, and garnish with fresh cilantro.\n",
    "\nRecipe: Quinoa Black Bean Salad\nIngredients: quinoa, black beans, corn, avocado, red bell pepper, cherry tomatoes, red onion, cilantro, lime, olive oil, salt, pepper\nInstructions:\n1. Cook quinoa according to package Instructions and let it cool.\n2. In a large bowl, combine cooked quinoa, black beans, corn, diced avocado, diced red bell pepper, halved cherry tomatoes, diced red onion, and chopped cilantro.\n3. In a small bowl, whisk together the juice of a lime, olive oil, salt, and pepper to make the dressing.\n4. Pour the dressing over the salad and toss gently to combine.\n5. Serve chilled or at room temperature. Enjoy!\n",
    "\nRecipe: Classic Butter Cookies\nIngredients: 2 cups all-purpose flour, 1/2 cup sugar, 1 cup unsalted butter, softened, 2 egg yolks\nInstructions:\n1. Preheat the oven to 350F (175C).\n2. In a mixing bowl, cream together the butter and sugar until smooth.\n3. Add the egg yolks one at a time, mixing well after each addition.\n4. Gradually stir in the flour until a dough forms.\n5. Roll out the dough on a floured surface and cut into desired shapes.\n6. Place the cookies on a baking sheet and bake for 10-12 minutes, or until lightly golden.\n7. Let cool before serving.\n",
    "\nRecipe: Roasted Garlic Rosemary Potatoes\nIngredients: potatoes, onions, garlic, rosemary, olive oil, salt, black pepper\nInstructions:\n1. Preheat the oven to 400F (200C).\n2. Wash and peel the potatoes, then cut them into cubes.\n3. Chop the onions and garlic cloves.\n4. In a bowl, mix the potatoes, onions, garlic, rosemary, olive oil, salt, and black pepper until well combined.\n5. Spread the mixture onto a baking sheet in a single layer.\n6. Roast in the preheated oven for 30-40 minutes or until the potatoes are golden brown and crispy, stirring occasionally.\n7. Serve hot and enjoy!\n",
    "\nRecipe: Lemon Dill Butter Salmon\nIngredients: salmon, lemon, dill, butter, salt, black pepper\nInstructions:\n1. Preheat the oven to 400F (200C).\n2. Place the salmon fillets on a baking sheet lined with parchment paper.\n3. Season the salmon with salt and black pepper.\n4. In a small bowl, mix together melted butter, chopped dill, and lemon juice.\n5. Brush the butter mixture over the salmon fillets.\n6. Slice the lemon and place a few slices on top of each fillet.\n7. Bake in the preheated oven for 12-15 minutes, or until the salmon is cooked through.\n8. Serve the lemon dill butter salmon hot, garnished with additional dill if desired.\n",
    "\nRecipe: Beef and Vegetable Skillet\nIngredients: 1 lb ground beef, 1 onion, chopped, 1 bell pepper, sliced, 2 tomatoes, diced, 1 cup shredded cheese, 1 tsp salt, 1/2 tsp black pepper, 1/2 tsp garlic powder, 1/2 tsp paprika, 1 tbsp olive oil\nInstructions:\n1. In a large skillet, heat olive oil over medium heat.\n2. Add ground beef and cook until browned.\n3. Add onion and bell pepper, cook until softened.\n4. Stir in tomatoes, salt, black pepper, garlic powder, and paprika.\n5. Simmer for 5-10 minutes until flavors combine.\n6. Sprinkle cheese on top and cover until melted.\n7. Serve hot and enjoy!\n",
    "\nRecipe: Shrimp and Pineapple Coconut Curry\nIngredients: shrimp, bell peppers, pineapple, coconut milk, onion, garlic, ginger, curry powder, salt, pepper, cilantro\nInstructions:\n1. In a large skillet, heat some oil over medium heat.\n2. Add chopped onion, garlic, and ginger. Cook until fragrant.\n3. Add sliced bell peppers and cook until slightly softened.\n4. Stir in curry powder and cook for another minute.\n5. Pour in coconut milk and bring to a simmer.\n6. Add shrimp and pineapple chunks. Cook until shrimp is pink and cooked through.\n7. Season with salt and pepper to taste.\n8. Garnish with chopped cilantro before serving.\n9. Serve over rice or noodles.\n",
    "\nRecipe: Chicken and Broccoli Rice Bowl\nIngredients: chicken, rice, broccoli, soy sauce, garlic, ginger, sesame oil, green onions\nInstructions:\n1. Cook rice according to package Instructions.\n2. In a large skillet, heat sesame oil over medium heat.\n3. Add diced chicken and cook until browned and cooked through.\n4. Add minced garlic and ginger, cook for another minute.\n5. Add broccoli florets and cook until slightly tender.\n6. Stir in cooked rice and soy sauce, mix well.\n7. Serve hot, garnished with sliced green onions.\n",
    "\nRecipe: Beef Stew\nIngredients: beef, potatoes, carrots, onions, beef broth, garlic, thyme, salt, pepper\nInstructions:\n1. In a large pot, brown the beef over medium-high heat.\n2. Add the onions and garlic, cook until fragrant.\n3. Stir in the potatoes, carrots, beef broth, thyme, salt, and pepper.\n4. Bring to a boil, then reduce heat and simmer for 1-2 hours until beef is tender.\n5. Serve hot and enjoy!\n",
    "\nRecipe: Grilled Salmon with Quinoa, Asparagus, and Lemon\nIngredients: salmon, quinoa, asparagus, lemon, olive oil, salt, black pepper, garlic powder\nInstructions:\n1. Preheat grill to medium-high heat.\n2. Season salmon with salt, black pepper, and garlic powder.\n3. Drizzle olive oil over asparagus and season with salt and black pepper.\n4. Grill salmon for 4-5 minutes per side or until cooked through.\n5. While salmon is grilling, cook quinoa according to package Instructions.\n6. Grill asparagus for 3-4 minutes, turning occasionally, until tender.\n7. Serve grilled salmon on a bed of cooked quinoa, with grilled asparagus on the side.\n8. Squeeze fresh lemon juice over the salmon before serving.\n",
    "\nRecipe: Stir-Fried Tofu with Bell Peppers and Zucchini\nIngredients: tofu, bell peppers, zucchini, soy sauce, garlic, ginger, cornstarch, vegetable oil, green onions\nInstructions:\n1. Press tofu to remove excess water, then cut into cubes.\n2. In a small bowl, mix soy sauce, minced garlic, grated ginger, and cornstarch to make a sauce.\n3. Heat vegetable oil in a pan over medium-high heat.\n4. Add tofu cubes and cook until golden brown on all sides. Remove from pan and set aside.\n5. In the same pan, add sliced bell peppers and zucchini. Cook until slightly tender.\n6. Return tofu to the pan and pour the sauce over the tofu and vegetables. Stir well to coat everything.\n7. Cook for a few more minutes until the sauce thickens and everything is heated through.\n8. Serve hot, garnished with sliced green onions.\n",
    "\nRecipe: Tomato Basil Pasta\nIngredients: pasta, tomatoes, garlic, basil, parmesan, olive oil, salt, black pepper\nInstructions:\n1. Cook the pasta according to package Instructions.\n2. In a pan, heat olive oil over medium heat.\n3. Add minced garlic and saut until fragrant.\n4. Add chopped tomatoes and cook until they start to soften.\n5. Season with salt and black pepper.\n6. Add cooked pasta to the pan and toss to combine.\n7. Sprinkle with chopped basil and grated parmesan before serving.\n",
    "\nRecipe: Pasta with Tomato Sauce\nIngredients: pasta, tomato sauce, olive oil, garlic, onion, salt, pepper, parmesan cheese\nInstructions:\n1. Cook the pasta according to package Instructions until al dente.\n2. In a separate pan, heat olive oil over medium heat.\n3. Add minced garlic and diced onion, saut until fragrant.\n4. Pour in the tomato sauce and season with salt and pepper.\n5. Simmer the sauce for 10-15 minutes, stirring occasionally.\n6. Once the pasta is cooked, drain and add it to the sauce.\n7. Toss the pasta in the sauce until well coated.\n8. Serve hot, garnished with grated parmesan cheese.\n",
    "\nRecipe: Cheesy Bacon and Egg Breakfast Casserole\nIngredients: eggs, bacon, cheese, milk, bread, salt, pepper\nInstructions:\n1. Preheat the oven to 350F (175C).\n2. Grease a baking dish with butter.\n3. Cut the bread into cubes and place them in the baking dish.\n4. Cook the bacon in a skillet until crispy, then crumble it over the bread cubes.\n5. In a bowl, whisk together the eggs, milk, salt, and pepper.\n6. Pour the egg mixture over the bread and bacon in the baking dish.\n7. Top with shredded cheese.\n8. Bake in the preheated oven for 25-30 minutes, or until the eggs are set and the cheese is melted and bubbly.\n9. Let it cool slightly before serving. Enjoy!\n",
    "\nRecipe: Roasted Garlic Rosemary Potatoes\nIngredients: potatoes, rosemary, garlic, olive oil, salt, black pepper\nInstructions:\n1. Preheat the oven to 400F (200C).\n2. Wash and scrub the potatoes, then cut them into small cubes.\n3. Mince the garlic and chop the rosemary leaves.\n4. In a bowl, toss the potatoes with olive oil, minced garlic, chopped rosemary, salt, and black pepper until evenly coated.\n5. Spread the seasoned potatoes on a baking sheet in a single layer.\n6. Roast in the preheated oven for about 30-35 minutes, or until the potatoes are golden brown and crispy on the outside, stirring halfway through cooking.\n7. Serve hot and enjoy!\n",
    "\nRecipe: Spinach and Feta Cheese Spanakopita\nIngredients: spinach, feta cheese, phyllo dough, olive oil, onion, garlic, dill, salt, pepper\nInstructions:\n1. Preheat the oven to 375F (190C).\n2. Heat olive oil in a pan over medium heat. Add chopped onion and minced garlic, saut until softened.\n3. Add chopped spinach to the pan and cook until wilted. Season with salt, pepper, and dill.\n4. Remove from heat and let the mixture cool slightly. Stir in crumbled feta cheese.\n5. Lay out a sheet of phyllo dough and brush with olive oil. Repeat with several more layers.\n6. Spread the spinach and feta mixture over the phyllo layers.\n7. Fold the phyllo dough over the filling to form a triangle or rectangle shape.\n8. Brush the top with olive oil and bake in the preheated oven for 25-30 minutes or until golden brown.\n9. Let it cool slightly before serving. Enjoy your delicious Spinach and Feta Cheese Spanakopita!\n",
    "\nRecipe: Garlic Roasted Potatoes\nIngredients: potatoes, onions, garlic, olive oil, salt, black pepper, rosemary\nInstructions:\n1. Preheat the oven to 400F (200C).\n2. Wash and peel the potatoes, then cut them into cubes.\n3. Chop the onions and garlic.\n4. In a bowl, mix the potatoes, onions, garlic, olive oil, salt, black pepper, and rosemary until well combined.\n5. Spread the mixture on a baking sheet in a single layer.\n6. Roast in the preheated oven for about 30-40 minutes or until the potatoes are golden brown and crispy, stirring occasionally.\n7. Serve hot and enjoy!\n",
    "\nRecipe: Taco Salad\nIngredients: 1 lb ground beef, 1 packet taco seasoning, 1 head lettuce, chopped, 1 cup shredded cheese, 1 cup salsa, 1/2 cup diced tomatoes, 1/2 cup sliced black olives, 1/4 cup diced red onion, 1/4 cup sour cream, 1/4 cup chopped cilantro, 1/4 cup sliced jalapenos, 1/4 cup crushed tortilla chips\nInstructions:\n1. In a skillet, cook the ground beef over medium heat until browned. Drain excess fat.\n2. Add taco seasoning and water according to package Instructions. Simmer for 5 minutes.\n3. In a large bowl, combine chopped lettuce, shredded cheese, diced tomatoes, sliced black olives, diced red onion, and cooked ground beef mixture.\n4. Top with salsa, sour cream, chopped cilantro, sliced jalapenos, and crushed tortilla chips.\n5. Toss everything together until well combined.\n6. Serve immediately and enjoy!\n",
    "\nRecipe: Chickpea Salad with Feta Cheese\nIngredients: chickpeas, cucumber, tomatoes, feta cheese, red onion, olive oil, lemon juice, salt, black pepper, fresh parsley\nInstructions:\n1. Rinse and drain the chickpeas.\n2. Dice the cucumber, tomatoes, and red onion.\n3. In a large bowl, combine the chickpeas, cucumber, tomatoes, red onion, and crumbled feta cheese.\n4. Drizzle olive oil and lemon juice over the salad.\n5. Season with salt and black pepper to taste.\n6. Toss everything together until well combined.\n7. Garnish with fresh parsley before serving.\n",
    "\nRecipe: Cheesy Broccoli Pasta\nIngredients: pasta, broccoli, cheese, butter, flour, milk, salt, pepper\nInstructions:\n1. Cook pasta according to package Instructions. Drain and set aside.\n2. In a large saucepan, melt butter over medium heat. Stir in flour and cook for 1-2 minutes until golden brown.\n3. Gradually whisk in milk until smooth and thickened.\n4. Add cheese, salt, and pepper, stirring until cheese is melted and sauce is creamy.\n5. Steam broccoli until tender-crisp.\n6. Combine cooked pasta, broccoli, and cheese sauce in a large bowl, tossing until well coated.\n7. Serve hot and enjoy!\n",
    "\nRecipe: Beef Stew\nIngredients: potatoes, carrots, peas, beef, onion, garlic, beef broth, tomato paste, salt, pepper, thyme, bay leaves\nInstructions:\n1. Heat oil in a large pot over medium heat.\n2. Add diced onion and minced garlic, cook until softened.\n3. Add cubed beef, cook until browned on all sides.\n4. Stir in tomato paste, salt, pepper, thyme, and bay leaves.\n5. Pour in beef broth, bring to a simmer.\n6. Add chopped potatoes and carrots, simmer for 20 minutes.\n7. Stir in peas and cook for an additional 5 minutes.\n8. Remove bay leaves before serving.\n9. Enjoy your delicious beef stew!\n",
    "\nRecipe: Spinach and Chickpea Salad with Bell Peppers and Feta Cheese\nIngredients: spinach, chickpeas, bell peppers, feta cheese, red onion, cherry tomatoes, olive oil, lemon juice, salt, black pepper\nInstructions:\n1. Rinse and drain the chickpeas.\n2. In a large bowl, combine spinach, chickpeas, diced bell peppers, crumbled feta cheese, sliced red onion, and halved cherry tomatoes.\n3. In a small bowl, whisk together olive oil, lemon juice, salt, and black pepper to make the dressing.\n4. Pour the dressing over the salad and toss to combine.\n5. Serve and enjoy!\n",
    "\nRecipe: Grilled Salmon with Asparagus\nIngredients: salmon, asparagus, lemon, dill, olive oil, salt, black pepper\nInstructions:\n1. Preheat the grill to medium-high heat.\n2. Season the salmon with salt, black pepper, and a drizzle of olive oil.\n3. Place the salmon on the grill and cook for about 4-5 minutes per side, or until cooked to your desired level of doneness.\n4. While the salmon is cooking, toss the asparagus with olive oil, salt, and black pepper.\n5. Add the asparagus to the grill and cook for about 3-4 minutes, or until tender and slightly charred.\n6. Remove the salmon and asparagus from the grill.\n7. Serve the grilled salmon and asparagus with a squeeze of lemon juice and a sprinkle of fresh dill on top.\n8. Enjoy!\n",
    "\nRecipe: Ginger Soy Tofu Stir-Fry\nIngredients: tofu, soy sauce, ginger, green onions, garlic, vegetable oil, cornstarch, sugar, rice vinegar, sesame oil, red pepper flakes, bell peppers, broccoli florets\nInstructions:\n1. Press tofu to remove excess water, then cut into cubes.\n2. In a bowl, mix soy sauce, minced ginger, minced garlic, cornstarch, sugar, rice vinegar, sesame oil, and red pepper flakes.\n3. Marinate tofu in the sauce for at least 30 minutes.\n4. Heat vegetable oil in a pan over medium-high heat.\n5. Add marinated tofu and cook until browned on all sides.\n6. Add sliced bell peppers, broccoli florets, and chopped green onions to the pan.\n7. Stir-fry until vegetables are tender-crisp.\n8. Serve hot over rice or noodles.\n",
    "\nRecipe: Garlic Shrimp Stir-Fry\nIngredients: shrimp, zucchini, mushrooms, bell peppers, garlic, soy sauce, sesame oil, ginger, cornstarch, green onions\nInstructions:\n1. In a small bowl, mix soy sauce, sesame oil, minced garlic, grated ginger, and cornstarch. Set aside.\n2. Heat a large skillet over medium-high heat and add a bit of oil.\n3. Add the shrimp and cook until pink and opaque, then remove from the skillet and set aside.\n4. In the same skillet, add more oil if needed and stir-fry the zucchini, mushrooms, and bell peppers until slightly tender.\n5. Add the cooked shrimp back to the skillet and pour the sauce over the Ingredients.\n6. Stir well and cook for a few more minutes until the sauce thickens.\n7. Serve hot, garnished with chopped green onions.\n",
    "\nRecipe: Tomato and Onion Pasta\nIngredients: tomato, onion, garlic, pasta, olive oil, salt, pepper\nInstructions:\n1. Cook the pasta according to package Instructions.\n2. In a pan, heat olive oil over medium heat.\n3. Add chopped onion and minced garlic, saut until fragrant.\n4. Add diced tomatoes, salt, and pepper. Cook until tomatoes are soft.\n5. Toss the cooked pasta with the tomato and onion mixture.\n6. Serve hot and enjoy!\n",
    "\nRecipe: Quinoa Stuffed Bell Peppers\nIngredients: quinoa, bell peppers, corn, black beans, onion, garlic, tomato, cheese, spices (such as cumin, paprika, salt, pepper)\nInstructions:\n1. Preheat the oven to 375F (190C).\n2. Cook quinoa according to package Instructions.\n3. In a skillet, saut chopped onion and minced garlic until fragrant.\n4. Add diced tomatoes, corn, and black beans to the skillet. Cook until heated through.\n5. Stir in cooked quinoa and season with spices.\n6. Cut the tops off the bell peppers and remove seeds. Fill each pepper with the quinoa mixture.\n7. Place stuffed peppers in a baking dish, top with cheese, and cover with foil.\n8. Bake for 25-30 minutes, then remove foil and bake for an additional 5-10 minutes until cheese is melted and peppers are tender.\n9. Serve hot and enjoy!\n",
    "\nRecipe: Garlic Shrimp and Zucchini Stir-Fry\nIngredients: shrimp, zucchini, olive oil, garlic, soy sauce, sesame oil, ginger, cornstarch, green onions, red pepper flakes\nInstructions:\n1. In a bowl, mix shrimp with soy sauce, sesame oil, minced garlic, and cornstarch. Let it marinate for 15 minutes.\n2. Heat olive oil in a pan over medium-high heat. Add sliced zucchini and cook until slightly tender.\n3. Add the marinated shrimp to the pan and cook until they turn pink and opaque.\n4. Stir in grated ginger, chopped green onions, and red pepper flakes. Cook for another minute.\n5. Serve the garlic shrimp and zucchini stir-fry hot with steamed rice or noodles.\n",
    "\nRecipe: Cheesy Bacon and Bell Pepper Frittata\nIngredients: eggs, bacon, cheese, bell peppers, onion, milk, salt, pepper\nInstructions:\n1. Preheat the oven to 350F (175C).\n2. In a skillet, cook the bacon until crispy. Remove and drain on paper towels, then crumble into pieces.\n3. In the same skillet, saut the diced bell peppers and onions until softened.\n4. In a bowl, whisk together the eggs, milk, salt, and pepper.\n5. Stir in the cooked bacon, bell peppers, onions, and shredded cheese.\n6. Pour the mixture into a greased baking dish.\n7. Bake in the preheated oven for 25-30 minutes, or until the frittata is set and slightly golden on top.\n8. Slice and serve hot. Enjoy!\n",
    "\nRecipe: Shrimp and Spinach Pasta\nIngredients: shrimp, pasta, spinach, tomatoes, garlic, olive oil, salt, black pepper, red pepper flakes, parmesan cheese\nInstructions:\n1. Cook pasta according to package Instructions.\n2. In a large skillet, heat olive oil over medium heat.\n3. Add minced garlic and cook until fragrant.\n4. Add shrimp and cook until pink and cooked through.\n5. Stir in chopped tomatoes and spinach, cook until spinach wilts.\n6. Season with salt, black pepper, and red pepper flakes to taste.\n7. Add cooked pasta to the skillet and toss to combine.\n8. Serve hot, garnished with grated parmesan cheese.\n",
    "\nRecipe: Roasted Chickpeas with Cumin and Lemon\nIngredients: chickpeas, cumin, garlic, lemon, olive oil, salt, black pepper\nInstructions:\n1. Preheat the oven to 400F (200C).\n2. Rinse and drain a can of chickpeas, then pat them dry with a paper towel.\n3. In a bowl, toss the chickpeas with olive oil, cumin, minced garlic, salt, and black pepper until evenly coated.\n4. Spread the chickpeas in a single layer on a baking sheet.\n5. Roast in the preheated oven for 25-30 minutes, or until crispy and golden brown, shaking the pan halfway through.\n6. Remove from the oven and squeeze fresh lemon juice over the roasted chickpeas.\n7. Serve warm as a delicious and healthy snack or topping for salads.\n",
    "\nRecipe: Teriyaki Shrimp Stir-Fry\nIngredients: shrimp, bell peppers, pineapple, teriyaki sauce, garlic, ginger, soy sauce, cornstarch, vegetable oil, rice\nInstructions:\n1. In a small bowl, mix together teriyaki sauce, soy sauce, minced garlic, grated ginger, and cornstarch. Set aside.\n2. Heat vegetable oil in a large skillet or wok over medium-high heat.\n3. Add shrimp and stir-fry until pink and cooked through. Remove shrimp from the skillet and set aside.\n4. In the same skillet, add sliced bell peppers and pineapple chunks. Stir-fry until slightly tender.\n5. Return the cooked shrimp to the skillet and pour the teriyaki sauce mixture over the Ingredients.\n6. Stir well to coat everything in the sauce and cook for an additional 2-3 minutes.\n7. Serve the teriyaki shrimp stir-fry over cooked rice. Enjoy!\n",
    "\nRecipe: Spinach and Cheese Pasta\nIngredients: pasta, spinach, cheese, olive oil, garlic, salt, pepper\nInstructions:\n1. Cook the pasta according to package Instructions.\n2. In a pan, heat olive oil over medium heat and saut minced garlic until fragrant.\n3. Add spinach to the pan and cook until wilted.\n4. Add cooked pasta to the pan and mix well.\n5. Stir in cheese until melted and well combined.\n6. Season with salt and pepper to taste.\n7. Serve hot and enjoy!\n",
    "\nRecipe: Vegetable Medley\nIngredients: potatoes, carrots, peas, onion, garlic, olive oil, salt, pepper\nInstructions:\n1. Peel and chop the potatoes, carrots, and onion.\n2. Mince the garlic.\n3. In a large skillet, heat olive oil over medium heat.\n4. Add the chopped vegetables and garlic to the skillet.\n5. Season with salt and pepper to taste.\n6. Cook, stirring occasionally, until the vegetables are tender.\n7. Serve hot as a side dish or over rice.\n",
    "\nRecipe: Tofu and Broccoli Stir-Fry\nIngredients: tofu, broccoli, ginger, soy sauce, garlic, vegetable oil, cornstarch, rice vinegar, sesame oil, green onions, red pepper flakes\nInstructions:\n1. Press tofu to remove excess water, then cut into cubes.\n2. In a small bowl, mix soy sauce, rice vinegar, sesame oil, cornstarch, and a pinch of red pepper flakes.\n3. Heat vegetable oil in a pan over medium heat, add tofu cubes and cook until golden brown.\n4. Remove tofu from the pan and set aside.\n5. In the same pan, add more oil if needed, then stir-fry broccoli, ginger, and minced garlic until tender-crisp.\n6. Add the tofu back to the pan, pour the sauce over the tofu and broccoli mixture, and stir well to coat.\n7. Cook for a few more minutes until the sauce thickens and everything is heated through.\n8. Serve hot, garnished with sliced green onions and more red pepper flakes if desired.\n",
    "\nRecipe: Shrimp Stir-Fry\nIngredients: shrimp, zucchini, bell peppers, onions, soy sauce, garlic, ginger, sesame oil, cornstarch, rice\nInstructions:\n1. In a bowl, mix soy sauce, minced garlic, grated ginger, and cornstarch. Add shrimp and let it marinate for 15 minutes.\n2. Heat sesame oil in a pan over medium-high heat. Add sliced onions, bell peppers, and zucchini. Stir-fry until vegetables are tender-crisp.\n3. Push vegetables to the side of the pan and add marinated shrimp. Cook until shrimp turn pink and opaque.\n4. Combine shrimp and vegetables. Serve over cooked rice.\n",
    "\nRecipe: Quinoa Avocado Black Bean Salad\nIngredients: quinoa, avocado, black beans, cherry tomatoes, red onion, cilantro, lime, olive oil, salt, pepper\nInstructions:\n1. Cook quinoa according to package Instructions and let it cool.\n2. In a large bowl, combine cooked quinoa, diced avocado, drained and rinsed black beans, halved cherry tomatoes, diced red onion, chopped cilantro, and mix well.\n3. In a small bowl, whisk together the juice of a lime, olive oil, salt, and pepper to make the dressing.\n4. Pour the dressing over the salad and toss gently to combine.\n5. Serve chilled and enjoy!\n",
    "\nRecipe: Garlic Rosemary Roasted Potatoes\nIngredients: potatoes, butter, garlic, rosemary, salt, black pepper, olive oil\nInstructions:\n1. Preheat the oven to 400F (200C).\n2. Wash and dice the potatoes into small cubes.\n3. Melt the butter in a microwave-safe bowl and mix in minced garlic and chopped rosemary.\n4. In a large mixing bowl, toss the diced potatoes with the garlic rosemary butter mixture, salt, black pepper, and a drizzle of olive oil until evenly coated.\n5. Spread the potatoes in a single layer on a baking sheet lined with parchment paper.\n6. Roast in the preheated oven for 30-35 minutes, or until the potatoes are golden brown and crispy on the outside, stirring halfway through cooking.\n7. Serve hot and enjoy!\n",
    "\nRecipe: Creamy Shrimp Pasta\nIngredients: shrimp, pasta, cream sauce, parmesan, butter, garlic, salt, pepper, parsley\nInstructions:\n1. Cook pasta according to package Instructions.\n2. In a large skillet, melt butter over medium heat.\n3. Add minced garlic and cook until fragrant.\n4. Add shrimp and cook until pink and cooked through.\n5. Stir in cream sauce and bring to a simmer.\n6. Add cooked pasta to the skillet and toss to coat in the sauce.\n7. Season with salt and pepper to taste.\n8. Serve hot, garnished with grated parmesan and chopped parsley.\n",
    "\nRecipe: Spinach and Feta Cheese Spanakopita\nIngredients: spinach, feta cheese, phyllo dough, olive oil, onion, garlic, dill, salt, pepper\nInstructions:\n1. Preheat the oven to 375F (190C).\n2. Heat olive oil in a pan over medium heat. Add chopped onion and minced garlic, saut until softened.\n3. Add chopped spinach to the pan and cook until wilted. Season with salt, pepper, and dill.\n4. Remove from heat and let the mixture cool slightly. Stir in crumbled feta cheese.\n5. Lay out a sheet of phyllo dough and brush with olive oil. Place another sheet on top and repeat until you have 4 layers.\n6. Cut the phyllo dough into squares. Place a spoonful of the spinach and feta mixture in the center of each square.\n7. Fold the phyllo dough over the filling to form a triangle. Brush the tops with olive oil.\n8. Bake in the preheated oven for 20-25 minutes or until golden brown and crispy.\n9. Serve the spinach and feta cheese spanakopita warm. Enjoy!\n",
    "\nRecipe: Garlic Shrimp Pasta\nIngredients: shrimp, garlic, olive oil, pasta, salt, black pepper, red pepper flakes, parsley, lemon juice\nInstructions:\n1. Cook pasta according to package Instructions.\n2. In a large skillet, heat olive oil over medium heat.\n3. Add minced garlic and cook until fragrant.\n4. Add shrimp to the skillet and cook until pink and cooked through.\n5. Season with salt, black pepper, and red pepper flakes.\n6. Add cooked pasta to the skillet and toss to combine.\n7. Drizzle with lemon juice and garnish with chopped parsley.\n8. Serve hot and enjoy!\n",
    "\nRecipe: Stir-Fried Tofu with Broccoli and Bell Peppers\nIngredients: tofu, broccoli, bell peppers, sesame oil, soy sauce, garlic, ginger, cornstarch, rice vinegar, brown sugar\nInstructions:\n1. Press tofu to remove excess water, then cut into cubes.\n2. In a small bowl, mix soy sauce, minced garlic, grated ginger, cornstarch, rice vinegar, and brown sugar to make the sauce.\n3. Heat sesame oil in a pan over medium-high heat.\n4. Add tofu cubes and cook until golden brown on all sides.\n5. Remove tofu from the pan and set aside.\n6. In the same pan, add more sesame oil if needed and stir-fry broccoli and bell peppers until slightly tender.\n7. Add the tofu back to the pan and pour the sauce over the tofu and vegetables.\n8. Stir well to coat everything in the sauce and cook for a few more minutes until the sauce thickens.\n9. Serve hot over rice or noodles.\n",
    "\nRecipe: Vegetable Stir-Fry with Chickpeas\nIngredients: mushrooms, zucchini, bell peppers, chickpeas, soy sauce, garlic, ginger, sesame oil, rice vinegar, cornstarch, green onions, sesame seeds\nInstructions:\n1. In a small bowl, mix soy sauce, rice vinegar, minced garlic, grated ginger, and cornstarch. Set aside.\n2. Heat sesame oil in a large pan over medium-high heat.\n3. Add sliced mushrooms, zucchini, and bell peppers. Stir-fry for 5-7 minutes until vegetables are tender.\n4. Add chickpeas and the sauce mixture to the pan. Cook for an additional 2-3 minutes, stirring constantly.\n5. Garnish with chopped green onions and sesame seeds before serving.\n6. Serve hot over rice or noodles.\n",
    "\nRecipe: Coconut Chickpea Curry\nIngredients: chickpeas, curry powder, coconut milk, onion, garlic, ginger, tomatoes, spinach, salt, pepper, olive oil\nInstructions:\n1. Heat olive oil in a large pan over medium heat.\n2. Add chopped onion, minced garlic, and grated ginger. Cook until softened.\n3. Stir in curry powder and cook for another minute.\n4. Add diced tomatoes and cook until they start to break down.\n5. Pour in coconut milk and bring to a simmer.\n6. Add drained and rinsed chickpeas, season with salt and pepper.\n7. Simmer for 15-20 minutes, stirring occasionally.\n8. Add spinach and cook until wilted.\n9. Serve hot over rice or with naan bread.\n",
    "\nRecipe: Grilled Salmon with Lemon-Dill Asparagus\nIngredients: salmon, lemon, dill, asparagus, olive oil, salt, black pepper\nInstructions:\n1. Preheat grill to medium-high heat.\n2. In a small bowl, mix together olive oil, lemon juice, dill, salt, and black pepper.\n3. Brush the salmon fillets with the olive oil mixture.\n4. Place the salmon fillets on the grill and cook for about 4-5 minutes per side, or until cooked through.\n5. In the meantime, toss asparagus spears with olive oil, salt, and black pepper.\n6. Grill the asparagus for about 3-4 minutes, or until tender-crisp.\n7. Serve the grilled salmon with lemon-dill asparagus on the side. Enjoy!\n",
    "\nRecipe: Garlic Butter Mushroom Saute\nIngredients: mushrooms, garlic, thyme, butter, salt, black pepper, olive oil\nInstructions:\n1. Heat olive oil in a pan over medium heat.\n2. Add minced garlic and saut until fragrant.\n3. Add sliced mushrooms and cook until they release their juices.\n4. Stir in thyme, salt, and black pepper.\n5. Add butter and continue cooking until mushrooms are tender.\n6. Serve hot as a side dish or over pasta.\n",
    "\nRecipe: Creamy Shrimp and Spinach Pasta\nIngredients: shrimp, pasta, cream sauce, spinach, garlic, butter, salt, pepper, parmesan cheese\nInstructions:\n1. Cook the pasta according to package Instructions.\n2. In a large skillet, melt butter over medium heat. Add minced garlic and cook until fragrant.\n3. Add the shrimp to the skillet and cook until pink and cooked through.\n4. Stir in the cream sauce and spinach, cooking until the spinach wilts.\n5. Season with salt and pepper to taste.\n6. Add the cooked pasta to the skillet and toss to combine.\n7. Serve hot, garnished with grated parmesan cheese.\n",
    "\nRecipe: Coconut Lentil Curry with Spinach\nIngredients: 1 cup lentils, 1 can coconut milk, 2 tbsp curry powder, 2 cups spinach, 1 onion, chopped, 2 cloves garlic, minced, 1 tsp ginger, grated, 1 tbsp vegetable oil, Salt and pepper to taste, Fresh cilantro for garnish\nInstructions:\n1. In a large pot, heat vegetable oil over medium heat.\n2. Add chopped onion, minced garlic, and grated ginger. Cook until onion is translucent.\n3. Stir in curry powder and cook for another minute.\n4. Add lentils and coconut milk. Bring to a simmer and cook for 20-25 minutes, or until lentils are tender.\n5. Add spinach and cook until wilted.\n6. Season with salt and pepper to taste.\n7. Serve hot, garnished with fresh cilantro.\n8. Enjoy your Coconut Lentil Curry with Spinach!\n",
    "\nRecipe: Spinach Avocado Strawberry Salad\nIngredients: spinach, avocado, strawberries, almonds, feta cheese, balsamic vinegar, olive oil, salt, pepper\nInstructions:\n1. Wash and dry the spinach leaves.\n2. Slice the avocado and strawberries.\n3. Toast the almonds in a pan until lightly browned.\n4. In a large bowl, combine the spinach, avocado, strawberries, toasted almonds, and crumbled feta cheese.\n5. Drizzle with balsamic vinegar and olive oil.\n6. Season with salt and pepper to taste.\n7. Toss gently to mix all Ingredients together.\n8. Serve and enjoy!\n",
    "\nRecipe: Coconut Shrimp Curry with Pineapple\nIngredients: shrimp, coconut milk, curry paste, bell peppers, pineapple, garlic, onion, ginger, cilantro, lime juice, salt, pepper, cooking oil\nInstructions:\n1. In a large skillet, heat cooking oil over medium heat.\n2. Add chopped onion, minced garlic, and grated ginger. Cook until fragrant.\n3. Stir in curry paste and cook for another minute.\n4. Add sliced bell peppers and cook until slightly softened.\n5. Pour in coconut milk and bring to a simmer.\n6. Add shrimp and cook until they turn pink and opaque.\n7. Stir in diced pineapple, lime juice, salt, and pepper.\n8. Simmer for a few more minutes to allow flavors to meld.\n9. Garnish with chopped cilantro before serving.\n10. Serve hot over rice or noodles.\n",
    "\nRecipe: Quinoa Salad with Spinach, Cherry Tomatoes, and Feta Cheese\nIngredients: quinoa, spinach, cherry tomatoes, feta cheese, olive oil, lemon juice, salt, pepper\nInstructions:\n1. Cook quinoa according to package Instructions and let it cool.\n2. In a large bowl, combine cooked quinoa, chopped spinach, halved cherry tomatoes, and crumbled feta cheese.\n3. Drizzle with olive oil and lemon juice, and season with salt and pepper.\n4. Toss everything together until well combined.\n5. Serve chilled or at room temperature. Enjoy!\n",
    "\nRecipe: Avocado Bacon Breakfast Sandwich\nIngredients: eggs, bacon, avocado, bread, cheese, tomato, lettuce\nInstructions:\n1. Cook the bacon in a skillet until crispy.\n2. Toast the bread slices.\n3. Slice the avocado, tomato, and lettuce.\n4. Fry the eggs in a pan to your desired doneness.\n5. Assemble the sandwich by layering bacon, avocado slices, tomato slices, lettuce, fried eggs, and cheese between the toasted bread slices.\n6. Enjoy your delicious Avocado Bacon Breakfast Sandwich!\n",
    "\nRecipe: Mushroom and Bell Pepper Chicken Soup\nIngredients: mushrooms, bell peppers, onions, chicken broth, chicken breast, garlic, thyme, salt, pepper, olive oil\nInstructions:\n1. Heat olive oil in a large pot over medium heat.\n2. Add chopped onions and minced garlic, saut until fragrant.\n3. Add sliced mushrooms and bell peppers, cook until slightly softened.\n4. Pour in chicken broth and bring to a simmer.\n5. Add diced chicken breast, thyme, salt, and pepper.\n6. Let the soup simmer for about 20 minutes until chicken is cooked through.\n7. Adjust seasoning to taste and serve hot.\n",
    "\nRecipe: Spinach Strawberry Salad\nIngredients: spinach, strawberries, almonds, feta cheese, red onion, balsamic vinegar, olive oil, honey, salt, pepper\nInstructions:\n1. Wash and dry the spinach leaves, then place them in a large salad bowl.\n2. Slice the strawberries and red onion, then add them to the bowl with the spinach.\n3. Sprinkle almonds and crumbled feta cheese over the salad.\n4. In a small bowl, whisk together balsamic vinegar, olive oil, honey, salt, and pepper to make the dressing.\n5. Drizzle the dressing over the salad and toss gently to combine all Ingredients.\n6. Serve immediately and enjoy!\n",
    "\nRecipe: Cajun Shrimp Stir-Fry\nIngredients: shrimp, zucchini, bell pepper, onion, cajun seasoning, garlic, olive oil, salt, black pepper, rice\nInstructions:\n1. Cook rice according to package Instructions.\n2. In a large skillet, heat olive oil over medium-high heat.\n3. Add chopped onion, bell pepper, and zucchini to the skillet. Cook until slightly softened.\n4. Add shrimp to the skillet and sprinkle cajun seasoning, salt, and black pepper. Cook until shrimp is pink and cooked through.\n5. Add minced garlic and stir for another minute.\n6. Serve the Cajun shrimp stir-fry over cooked rice.\n7. Enjoy!\n",
    "\nRecipe: Creamy Shrimp Pasta\nIngredients: shrimp, pasta, cream sauce, butter, garlic, salt, pepper, parmesan cheese, parsley\nInstructions:\n1. Cook the pasta according to package Instructions.\n2. In a large skillet, melt butter over medium heat. Add minced garlic and cook until fragrant.\n3. Add the shrimp to the skillet and cook until pink and cooked through.\n4. Pour in the cream sauce and stir to combine. Season with salt and pepper.\n5. Add the cooked pasta to the skillet and toss to coat in the sauce.\n6. Sprinkle with parmesan cheese and chopped parsley before serving.\n",
    "\nRecipe: Spinach and Feta Stuffed Cherry Tomatoes\nIngredients: spinach, cherry tomatoes, feta cheese, garlic, olive oil, salt, pepper\nInstructions:\n1. Preheat the oven to 375F (190C).\n2. Cut the tops off the cherry tomatoes and scoop out the seeds to create small cups.\n3. In a pan, saut chopped spinach with minced garlic in olive oil until wilted. Season with salt and pepper.\n4. Fill each cherry tomato cup with the spinach mixture and top with crumbled feta cheese.\n5. Place the stuffed cherry tomatoes on a baking sheet and bake for 10-15 minutes until the tomatoes are slightly softened and the cheese is melted.\n6. Serve warm and enjoy!\n",
    "\nRecipe: Quinoa Black Bean Salad\nIngredients: quinoa, black beans, corn, cilantro, red bell pepper, red onion, lime, olive oil, salt, pepper\nInstructions:\n1. Cook quinoa according to package Instructions and let it cool.\n2. In a large bowl, combine cooked quinoa, black beans, corn, chopped red bell pepper, diced red onion, and chopped cilantro.\n3. In a small bowl, whisk together lime juice, olive oil, salt, and pepper to make the dressing.\n4. Pour the dressing over the quinoa mixture and toss to combine.\n5. Refrigerate for at least 30 minutes before serving to allow the flavors to meld together.\n6. Serve chilled and enjoy!\n",
    "\nRecipe: Beef Stew\nIngredients: beef, potatoes, carrots, celery, onion, garlic, beef broth, tomato paste, bay leaves, salt, pepper\nInstructions:\n1. In a large pot, heat some oil over medium heat.\n2. Add diced onion and minced garlic, cook until fragrant.\n3. Add cubed beef and brown on all sides.\n4. Stir in tomato paste and cook for a few minutes.\n5. Add beef broth, bay leaves, salt, and pepper. Bring to a simmer.\n6. Add diced potatoes, carrots, and celery. Cover and simmer for about 5 hours, or until beef is tender.\n7. Adjust seasoning if needed.\n8. Serve hot and enjoy!\n",
    "\nRecipe: Quinoa Veggie Stir-Fry\nIngredients: quinoa, broccoli, bell pepper, zucchini, garlic, soy sauce, sesame oil, ginger, green onions, carrots\nInstructions:\n1. Cook quinoa according to package Instructions.\n2. In a large skillet, heat sesame oil over medium heat.\n3. Add minced garlic and grated ginger, saut for 1-2 minutes.\n4. Add chopped bell pepper, zucchini, and carrots, cook until slightly tender.\n5. Stir in broccoli florets and cook for an additional 2-3 minutes.\n6. Add cooked quinoa to the skillet, pour soy sauce over the mixture, and stir well to combine.\n7. Cook for another 2-3 minutes, allowing the flavors to meld together.\n8. Garnish with sliced green onions before serving.\n9. Enjoy your delicious quinoa veggie stir-fry!\n",
    "\nRecipe: Coconut Shrimp Curry with Pineapple\nIngredients: shrimp, coconut milk, curry paste, bell pepper, pineapple, onion, garlic, ginger, cilantro, lime, salt, pepper, vegetable oil\nInstructions:\n1. In a large skillet, heat vegetable oil over medium heat.\n2. Add chopped onion, minced garlic, and grated ginger. Cook until fragrant.\n3. Stir in curry paste and cook for another minute.\n4. Add sliced bell pepper and cook until slightly softened.\n5. Pour in coconut milk and bring to a simmer.\n6. Add shrimp and cook until pink and cooked through.\n7. Stir in diced pineapple and cook for a few more minutes.\n8. Season with salt and pepper to taste.\n9. Serve the curry over rice, garnished with chopped cilantro and a squeeze of lime juice.\n",
    "\nRecipe: Roasted Garlic Rosemary Potatoes\nIngredients: potatoes, garlic, rosemary, olive oil, salt, black pepper\nInstructions:\n1. Preheat the oven to 400F (200C).\n2. Wash and peel the potatoes, then cut them into small cubes.\n3. Mince the garlic and chop the rosemary leaves.\n4. In a bowl, toss the potatoes with olive oil, minced garlic, chopped rosemary, salt, and black pepper until evenly coated.\n5. Spread the seasoned potatoes on a baking sheet in a single layer.\n6. Roast in the preheated oven for about 30-35 minutes, or until the potatoes are golden brown and crispy on the outside.\n7. Serve hot and enjoy!\n",
    "\nRecipe: Spinach Strawberry Salad\nIngredients: spinach, strawberries, almonds, feta cheese, red onion, balsamic vinegar, olive oil, honey, salt, black pepper\nInstructions:\n1. Wash and dry the spinach leaves, then place them in a large salad bowl.\n2. Slice the strawberries and red onion, and add them to the bowl with the spinach.\n3. Sprinkle almonds and crumbled feta cheese over the salad.\n4. In a small bowl, whisk together balsamic vinegar, olive oil, honey, salt, and black pepper to make the dressing.\n5. Drizzle the dressing over the salad and toss gently to combine.\n6. Serve immediately and enjoy!\n",
    "\nRecipe: Quinoa Stuffed Bell Peppers\nIngredients: quinoa, bell pepper, corn, black beans, onion, garlic, tomato, cheese, cilantro, cumin, paprika, salt, pepper\nInstructions:\n1. Preheat the oven to 375F (190C).\n2. Cook quinoa according to package Instructions.\n3. In a skillet, saut diced onion and minced garlic until fragrant.\n4. Add diced tomato, corn, black beans, cooked quinoa, cumin, paprika, salt, and pepper. Cook for 5 minutes.\n5. Stir in chopped cilantro.\n6. Cut the tops off the bell peppers and remove seeds. Fill each pepper with the quinoa mixture.\n7. Place stuffed peppers in a baking dish, cover with foil, and bake for 25-30 minutes.\n8. Remove foil, sprinkle cheese on top of each pepper, and bake for an additional 5 minutes until cheese is melted.\n9. Serve hot and enjoy!\n",
    "\nRecipe: Shrimp and Vegetable Stir-Fry\nIngredients: shrimp, zucchini, bell pepper, pineapple, soy sauce, garlic, ginger, cornstarch, sesame oil, vegetable oil, salt, black pepper, rice\nInstructions:\n1. In a small bowl, mix soy sauce, minced garlic, grated ginger, cornstarch, sesame oil, salt, and black pepper. Set aside.\n2. Heat vegetable oil in a large skillet or wok over medium-high heat.\n3. Add shrimp and stir-fry until pink and cooked through. Remove shrimp from the skillet and set aside.\n4. In the same skillet, add more oil if needed and stir-fry zucchini, bell pepper, and pineapple until slightly tender.\n5. Return the shrimp to the skillet and pour the soy sauce mixture over the Ingredients. Stir well to coat everything evenly.\n6. Cook for another 2-3 minutes until the sauce thickens and the vegetables are cooked to your liking.\n7. Serve the stir-fry over cooked rice. Enjoy!\n",
    "\nRecipe: Pork and Cabbage Stir-Fry\nIngredients: pork, cabbage, ginger, green onions, soy sauce, garlic, sesame oil, cornstarch, rice vinegar\nInstructions:\n1. Slice the pork into thin strips and marinate with soy sauce, minced garlic, and cornstarch.\n2. Heat sesame oil in a pan over medium heat and add sliced ginger to infuse the oil.\n3. Add the marinated pork and stir-fry until cooked through.\n4. Add sliced cabbage and continue to stir-fry until slightly wilted.\n5. Mix in chopped green onions and a splash of rice vinegar.\n6. Serve hot over steamed rice.\n",
    "\nRecipe: Apple Cinnamon Pork Chops\nIngredients: pork chops, apples, cinnamon, brown sugar, salt, black pepper, butter, onion, garlic, chicken broth\nInstructions:\n1. Season pork chops with salt and black pepper.\n2. In a skillet, melt butter over medium heat.\n3. Add pork chops and cook until browned on both sides. Remove from skillet and set aside.\n4. In the same skillet, add sliced apples, diced onion, and minced garlic. Cook until softened.\n5. Stir in cinnamon, brown sugar, and chicken broth. Bring to a simmer.\n6. Return pork chops to the skillet and cook until the pork is cooked through and the sauce has thickened.\n7. Serve the pork chops with the apple cinnamon sauce on top.\n",
    "\nRecipe: Vegetable Medley\nIngredients: potato, carrot, peas, onion, garlic, olive oil, salt, pepper\nInstructions:\n1. Peel and chop the potato and carrot into small cubes.\n2. Finely chop the onion and garlic.\n3. In a pan, heat olive oil over medium heat.\n4. Add the chopped onion and garlic, saut until fragrant.\n5. Add the chopped potato and carrot, cook until slightly softened.\n6. Stir in the peas and season with salt and pepper.\n7. Cover and cook until all vegetables are tender.\n8. Serve hot as a side dish or over rice.\n",
    "\nRecipe: Beef Stir-Fry with Bell Pepper and Zucchini\nIngredients: beef, bell pepper, zucchini, soy sauce, garlic, ginger, cornstarch, vegetable oil, salt, black pepper\nInstructions:\n1. Slice the beef into thin strips and marinate with soy sauce, minced garlic, minced ginger, cornstarch, salt, and black pepper for 30 minutes.\n2. Heat vegetable oil in a pan over high heat.\n3. Add the marinated beef and stir-fry until browned. Remove from the pan and set aside.\n4. In the same pan, add sliced bell pepper and zucchini. Stir-fry until slightly tender.\n5. Return the beef to the pan and mix well with the vegetables.\n6. Serve hot and enjoy!\n",
    "\nRecipe: Ginger Sesame Tofu Stir-Fry\nIngredients: tofu, soy sauce, ginger, sesame oil, garlic, bell peppers, onion, broccoli, carrots, cornstarch, green onions, rice\nInstructions:\n1. Press tofu to remove excess water, then cut into cubes.\n2. In a bowl, mix soy sauce, minced ginger, and sesame oil. Add tofu cubes and marinate for 15-20 minutes.\n3. In a wok or large skillet, heat oil over medium-high heat. Add minced garlic and stir for 30 seconds.\n4. Add marinated tofu cubes and stir-fry until golden brown.\n5. Add sliced bell peppers, onion, broccoli, and carrots. Stir-fry until vegetables are tender-crisp.\n6. In a small bowl, mix cornstarch with water to create a slurry. Pour over the stir-fry and cook until sauce thickens.\n7. Serve over cooked rice and garnish with sliced green onions.\n",
    "\nRecipe: Quinoa Stuffed Portobello Mushrooms\nIngredients: quinoa, mushroom, spinach, feta cheese, olive oil, garlic, onion, bell pepper, salt, pepper, Italian seasoning\nInstructions:\n1. Preheat the oven to 375F (190C).\n2. Cook quinoa according to package Instructions.\n3. Clean the portobello mushrooms and remove the stems.\n4. In a skillet, heat olive oil over medium heat. Add minced garlic, diced onion, and chopped bell pepper. Cook until softened.\n5. Add chopped spinach to the skillet and cook until wilted.\n6. Stir in cooked quinoa, crumbled feta cheese, salt, pepper, and Italian seasoning. Mix well.\n7. Stuff the portobello mushrooms with the quinoa mixture.\n8. Place the stuffed mushrooms on a baking sheet and bake for 20-25 minutes, or until the mushrooms are tender.\n9. Serve hot and enjoy!\n",
    "\nRecipe: Pork and Cabbage Stir-Fry\nIngredients: pork, cabbage, ginger, green onion, soy sauce, garlic, sesame oil, cornstarch, rice vinegar\nInstructions:\n1. Slice the pork into thin strips and marinate with soy sauce, minced garlic, and cornstarch.\n2. Heat sesame oil in a pan over medium-high heat.\n3. Add sliced ginger and green onion, saut for a minute.\n4. Add the marinated pork and cook until browned.\n5. Add shredded cabbage and stir-fry until slightly wilted.\n6. Pour in a mixture of soy sauce, rice vinegar, and a little water.\n7. Stir well and cook until the sauce thickens.\n8. Serve hot with steamed rice.\n",
    "\nRecipe: Vegetable Medley\nIngredients: potato, carrot, peas, corn, onion, bell pepper, garlic, olive oil, salt, pepper\nInstructions:\n1. Peel and dice the potatoes and carrots.\n2. Heat olive oil in a pan over medium heat.\n3. Add diced onions and minced garlic, saut until fragrant.\n4. Add diced bell peppers, potatoes, and carrots, cook until slightly tender.\n5. Stir in peas and corn, season with salt and pepper.\n6. Cook for a few more minutes until all vegetables are cooked through.\n7. Serve hot as a side dish or over rice.\n",
    "\nRecipe: Beef Stir-Fry with Vegetables\nIngredients: beef, bell pepper, zucchini, mushrooms, soy sauce, garlic, ginger, cornstarch, sesame oil, vegetable oil\nInstructions:\n1. Slice the beef into thin strips and marinate with soy sauce, minced garlic, minced ginger, and cornstarch for 30 minutes.\n2. Heat vegetable oil in a wok or large skillet over high heat.\n3. Add the marinated beef and stir-fry until browned. Remove from the wok and set aside.\n4. In the same wok, add more vegetable oil if needed and stir-fry the bell pepper, zucchini, and mushrooms until slightly tender.\n5. Return the beef to the wok and stir to combine with the vegetables.\n6. Drizzle with sesame oil and serve hot.\n",
    "\nRecipe: Ginger Soy Tofu Stir-Fry\nIngredients: tofu, soy sauce, ginger, green onion, garlic, bell pepper, carrots, broccoli, cornstarch, vegetable oil\nInstructions:\n1. Press tofu to remove excess water, then cut into cubes.\n2. In a bowl, mix soy sauce, minced ginger, and minced garlic. Add tofu cubes and marinate for 15 minutes.\n3. In a separate bowl, mix cornstarch with water to create a slurry.\n4. Heat vegetable oil in a pan over medium-high heat. Add marinated tofu cubes and cook until browned on all sides.\n5. Add sliced bell pepper, julienned carrots, broccoli florets, and chopped green onions to the pan. Stir-fry for a few minutes.\n6. Pour in the cornstarch slurry and stir well until the sauce thickens.\n7. Serve hot and garnish with additional green onions.\n",
    "\nRecipe: Quinoa Salad with Spinach, Feta Cheese, and Olives\nIngredients: quinoa, spinach, feta cheese, olives, cherry tomatoes, red onion, cucumber, lemon, olive oil, salt, pepper\nInstructions:\n1. Cook quinoa according to package Instructions and let it cool.\n2. Chop spinach, feta cheese, olives, cherry tomatoes, red onion, and cucumber.\n3. In a large bowl, combine the cooked quinoa, chopped vegetables, and crumbled feta cheese.\n4. Drizzle with olive oil and lemon juice, and season with salt and pepper.\n5. Toss everything together until well combined.\n6. Serve chilled as a refreshing salad.\n",
    "\nRecipe: Pork and Cabbage Stir-Fry with Apple\nIngredients: pork, cabbage, caraway seeds, apple, soy sauce, garlic, ginger, vegetable oil, salt, pepper\nInstructions:\n1. Heat vegetable oil in a large skillet over medium-high heat.\n2. Add pork and cook until browned, about 5-7 minutes.\n3. Stir in garlic, ginger, and caraway seeds, and cook for another 1-2 minutes.\n4. Add cabbage and apple, and cook until slightly softened, about 3-4 minutes.\n5. Season with soy sauce, salt, and pepper, and stir well to combine.\n6. Cook for an additional 2-3 minutes, or until everything is heated through.\n7. Serve hot and enjoy!\n",
    "\nRecipe: Quinoa Salad with Spinach, Feta Cheese, and Cherry Tomatoes\nIngredients: quinoa, spinach, feta cheese, cherry tomatoes, olive oil, lemon juice, salt, pepper\nInstructions:\n1. Cook quinoa according to package Instructions and let it cool.\n2. In a large bowl, combine the cooked quinoa, chopped spinach, halved cherry tomatoes, and crumbled feta cheese.\n3. In a small bowl, whisk together olive oil, lemon juice, salt, and pepper to make the dressing.\n4. Pour the dressing over the quinoa mixture and toss to combine.\n5. Serve chilled as a refreshing and nutritious salad.\n",
    "\nRecipe: Creamy Pork and Mushroom Thyme Sauce\nIngredients: mushrooms, thyme, cream, pork, butter, garlic, salt, pepper\nInstructions:\n1. Heat butter in a skillet over medium heat.\n2. Add pork slices and cook until browned on both sides.\n3. Remove pork from skillet and set aside.\n4. In the same skillet, add minced garlic and saut until fragrant.\n5. Add sliced mushrooms and cook until they release their juices.\n6. Stir in thyme, salt, and pepper.\n7. Pour in cream and bring to a simmer.\n8. Return pork to the skillet and simmer until the sauce thickens.\n9. Serve hot over rice or pasta. Enjoy!\n",
    "\nRecipe: Sweet and Sour Shrimp Stir-Fry\nIngredients: shrimp, bell pepper, pineapple, soy sauce, ginger, garlic, cornstarch, rice vinegar, brown sugar, vegetable oil\nInstructions:\n1. In a small bowl, mix 1 tablespoon of cornstarch with 2 tablespoons of soy sauce and set aside.\n2. Heat 2 tablespoons of vegetable oil in a large skillet over medium-high heat.\n3. Add 1 pound of peeled and deveined shrimp to the skillet and cook until pink, about 2-3 minutes per side. Remove shrimp from skillet and set aside.\n4. In the same skillet, add 1 diced bell pepper and 1 cup of diced pineapple. Cook for 2-3 minutes until slightly softened.\n5. Add 1 tablespoon of minced ginger and 2 cloves of minced garlic to the skillet. Cook for an additional 1 minute.\n6. Return the cooked shrimp to the skillet and pour the cornstarch-soy sauce mixture over the Ingredients. Stir well to coat.\n7. Add 2 tablespoons of rice vinegar and 2 tablespoons of brown sugar to the skillet. Cook for another 2-3 minutes until the sauce thickens.\n8. Serve the sweet and sour shrimp stir-fry over cooked rice. Enjoy!\n",
    "\nRecipe: Stir-Fried Tofu with Broccoli and Bell Pepper\nIngredients: tofu, broccoli, bell pepper, sesame oil, soy sauce, garlic, ginger, cornstarch, vegetable broth, green onions\nInstructions:\n1. Press tofu to remove excess water, then cut into cubes.\n2. In a small bowl, mix soy sauce, sesame oil, minced garlic, grated ginger, and cornstarch to make a marinade.\n3. Marinate tofu in the sauce for at least 15 minutes.\n4. Heat a pan over medium-high heat and add sesame oil.\n5. Add tofu cubes and cook until browned on all sides.\n6. Remove tofu from the pan and set aside.\n7. In the same pan, add more sesame oil and stir-fry broccoli, bell pepper, and sliced green onions until slightly tender.\n8. Add vegetable broth and the remaining marinade to the pan, then return tofu to the mixture.\n9. Cook for a few more minutes until the sauce thickens and coats the Ingredients.\n10. Serve hot over rice or noodles.\n",
    "\nRecipe: Beef Stew\nIngredients: beef, potato, carrot, peas, onion, garlic, beef broth, tomato paste, salt, pepper, bay leaves\nInstructions:\n1. In a large pot, brown the beef over medium-high heat.\n2. Add chopped onion and minced garlic, cook until fragrant.\n3. Stir in diced potatoes, carrots, and peas.\n4. Pour in beef broth and tomato paste, season with salt, pepper, and add bay leaves.\n5. Bring to a boil, then reduce heat and simmer for about 1-2 hours until beef is tender.\n6. Remove bay leaves before serving. Enjoy your delicious beef stew!\n",
    "\nRecipe: Spiced Eggplant Stir-Fry\nIngredients: eggplant, bell pepper, onion, cumin, coriander, garlic, soy sauce, sesame oil, rice vinegar, red pepper flakes\nInstructions:\n1. Heat sesame oil in a large pan over medium heat.\n2. Add diced onion and minced garlic, saut until fragrant.\n3. Add sliced bell pepper and diced eggplant, cook until slightly softened.\n4. Sprinkle cumin, coriander, and red pepper flakes over the vegetables, stir well.\n5. Drizzle soy sauce and rice vinegar over the mixture, continue cooking until vegetables are tender.\n6. Adjust seasoning with salt and pepper if needed.\n7. Serve hot over rice or noodles.\n",
    "\nRecipe: Chickpea Salad\nIngredients: chickpeas, tomatoes, cucumbers, red onion, olive oil, lemon juice, salt, black pepper, fresh parsley\nInstructions:\n1. Rinse and drain the chickpeas.\n2. Chop the tomatoes, cucumbers, and red onion into bite-sized pieces.\n3. In a large bowl, combine the chickpeas, tomatoes, cucumbers, and red onion.\n4. Drizzle with olive oil and lemon juice.\n5. Season with salt and black pepper to taste.\n6. Toss the salad gently to combine all Ingredients.\n7. Garnish with fresh parsley before serving.\n8. Enjoy your delicious chickpea salad!\n",
    "\nRecipe: Apple Cinnamon Pork Chops\nIngredients: pork chops, apples, onion, cinnamon, salt, pepper, butter, brown sugar\nInstructions:\n1. Season pork chops with salt and pepper.\n2. In a skillet, melt butter over medium heat.\n3. Add pork chops and cook until browned on both sides.\n4. Remove pork chops from skillet and set aside.\n5. In the same skillet, add sliced apples, diced onion, cinnamon, and brown sugar.\n6. Cook until apples are tender and caramelized.\n7. Return pork chops to the skillet and cook until heated through.\n8. Serve pork chops topped with the apple mixture.\n",
    "\nRecipe: Quinoa Avocado Salad\nIngredients: quinoa, avocado, corn, black beans, cherry tomatoes, red onion, cilantro, lime, olive oil, salt, pepper\nInstructions:\n1. Cook quinoa according to package Instructions and let it cool.\n2. In a large bowl, combine the cooked quinoa, diced avocado, drained and rinsed black beans, corn kernels, halved cherry tomatoes, finely chopped red onion, and chopped cilantro.\n3. In a small bowl, whisk together the juice of a lime, olive oil, salt, and pepper to make the dressing.\n4. Pour the dressing over the salad and toss gently to combine.\n5. Serve chilled and enjoy!\n",
    "\nRecipe: Shrimp Stir-Fry\nIngredients: shrimp, bell pepper, zucchini, mushrooms, garlic, soy sauce, sesame oil, ginger, cornstarch, green onions\nInstructions:\n1. In a small bowl, mix together soy sauce, minced garlic, grated ginger, and cornstarch. Set aside.\n2. Heat sesame oil in a large skillet or wok over medium-high heat.\n3. Add shrimp and stir-fry until pink and cooked through. Remove from skillet and set aside.\n4. In the same skillet, add sliced bell pepper, zucchini, and mushrooms. Stir-fry until vegetables are tender-crisp.\n5. Return shrimp to the skillet and pour the soy sauce mixture over the Ingredients. Stir well to combine and cook for an additional 2-3 minutes.\n6. Garnish with sliced green onions and serve hot over rice or noodles.\n",
    "\nRecipe: Pork and Cabbage Stir-Fry\nIngredients: pork, cabbage, soy sauce, green onions, garlic, ginger, vegetable oil, cornstarch, rice vinegar\nInstructions:\n1. Slice the pork into thin strips and marinate in soy sauce for 15 minutes.\n2. Heat vegetable oil in a pan over medium-high heat.\n3. Add minced garlic and ginger, then stir-fry until fragrant.\n4. Add the marinated pork and cook until browned.\n5. Add sliced cabbage and continue to stir-fry until slightly softened.\n6. In a small bowl, mix soy sauce, cornstarch, and rice vinegar to create a sauce.\n7. Pour the sauce over the pork and cabbage mixture, stirring well to combine.\n8. Cook for an additional 2-3 minutes until the sauce thickens.\n9. Garnish with chopped green onions before serving.\n10. Enjoy your delicious Pork and Cabbage Stir-Fry!\n",
    "\nRecipe: Shrimp and Zucchini Pasta\nIngredients: shrimp, zucchini, pasta sauce, parmesan cheese, garlic, olive oil, salt, black pepper, red pepper flakes, fresh basil leaves\nInstructions:\n1. Cook pasta according to package Instructions.\n2. In a large skillet, heat olive oil over medium heat.\n3. Add minced garlic and red pepper flakes, saut for 1 minute.\n4. Add sliced zucchini and cook until slightly tender, about 5 minutes.\n5. Push zucchini to the side of the skillet and add shrimp, cook until pink and opaque, about 3-4 minutes.\n6. Pour in pasta sauce and stir to combine with shrimp and zucchini.\n7. Season with salt and black pepper to taste.\n8. Add cooked pasta to the skillet and toss to coat with the sauce.\n9. Serve hot, garnished with grated parmesan cheese and fresh basil leaves.\n",
    "\nRecipe: Shrimp and Vegetable Stir-Fry\nIngredients: shrimp, bell peppers, zucchini, squash, soy sauce, garlic, ginger, sesame oil, cornstarch, green onions\nInstructions:\n1. In a small bowl, mix together soy sauce, minced garlic, grated ginger, sesame oil, and cornstarch to make the sauce.\n2. Heat a large skillet or wok over medium-high heat and add some oil.\n3. Add the shrimp and stir-fry until pink and cooked through. Remove from the skillet and set aside.\n4. In the same skillet, add more oil if needed and stir-fry the bell peppers, zucchini, and squash until slightly tender.\n5. Return the shrimp to the skillet and pour the sauce over the Ingredients. Stir well to coat everything evenly.\n6. Cook for a few more minutes until the sauce thickens and the vegetables are cooked to your liking.\n7. Serve the stir-fry hot, garnished with sliced green onions.\n8. Enjoy your delicious Shrimp and Vegetable Stir-Fry!\n",
    "\nRecipe: Roasted Potato and Vegetable Medley\nIngredients: potatoes, onions, garlic, bell peppers, olive oil, salt, black pepper, rosemary\nInstructions:\n1. Preheat the oven to 400F (200C).\n2. Wash and chop the potatoes, onions, garlic, and bell peppers into bite-sized pieces.\n3. Place the chopped vegetables on a baking sheet.\n4. Drizzle with olive oil and season with salt, black pepper, and rosemary. Toss to coat evenly.\n5. Roast in the preheated oven for 25-30 minutes, or until the vegetables are tender and slightly browned.\n6. Serve hot as a delicious side dish.\n",
    "\nRecipe: Beef Stew\nIngredients: beef, carrots, potatoes, celery, onion, garlic, beef broth, tomato paste, bay leaves, salt, pepper\nInstructions:\n1. In a large pot, brown the beef over medium-high heat.\n2. Add chopped onion and minced garlic, cook until fragrant.\n3. Stir in beef broth, tomato paste, bay leaves, salt, and pepper.\n4. Add chopped carrots, potatoes, and celery to the pot.\n5. Cover and simmer for 1-2 hours, or until beef and vegetables are tender.\n6. Remove bay leaves before serving. Enjoy!\n",
    "\nRecipe: Roasted Rosemary Potatoes\nIngredients: potatoes, olive oil, rosemary, salt, pepper, garlic powder\nInstructions:\n1. Preheat the oven to 400F (200C).\n2. Wash and dice the potatoes into small cubes.\n3. In a bowl, mix the diced potatoes with olive oil, rosemary, salt, pepper, and garlic powder until evenly coated.\n4. Spread the seasoned potatoes on a baking sheet in a single layer.\n5. Bake in the preheated oven for 25-30 minutes, or until the potatoes are golden brown and crispy on the outside.\n6. Serve hot and enjoy!\n",
    "\nRecipe: Chickpea Salad with Feta Cheese\nIngredients: chickpeas, tomatoes, cucumber, feta cheese, red onion, olive oil, lemon juice, salt, black pepper, fresh parsley\nInstructions:\n1. Rinse and drain the chickpeas.\n2. Dice the tomatoes, cucumber, and red onion.\n3. In a large bowl, combine the chickpeas, tomatoes, cucumber, red onion, and crumbled feta cheese.\n4. Drizzle olive oil and lemon juice over the salad.\n5. Season with salt and black pepper to taste.\n6. Toss the salad gently to mix all Ingredients.\n7. Garnish with fresh parsley before serving.\n",
    "\nRecipe: Beef Stew\nIngredients: beef, carrots, celery, potatoes, onions, garlic, beef broth, tomato paste, bay leaves, salt, pepper\nInstructions:\n1. In a large pot, heat some oil over medium heat.\n2. Add chopped onions and minced garlic, cook until fragrant.\n3. Add cubed beef and brown on all sides.\n4. Stir in tomato paste and cook for a few minutes.\n5. Add beef broth, bay leaves, salt, and pepper. Bring to a boil.\n6. Reduce heat, cover, and simmer for about 5 hours.\n7. Add chopped carrots, celery, and potatoes. Cook until vegetables are tender.\n8. Adjust seasoning if needed.\n9. Serve hot and enjoy!\n",
    "\nRecipe: Shrimp Stir-Fry\nIngredients: shrimp, bell peppers, zucchini, onions, soy sauce, garlic, ginger, sesame oil, cornstarch, rice\nInstructions:\n1. In a small bowl, mix together soy sauce, minced garlic, grated ginger, and cornstarch. Set aside.\n2. Heat sesame oil in a large skillet over medium-high heat.\n3. Add sliced onions and bell peppers to the skillet, and stir-fry for 2-3 minutes until slightly softened.\n4. Add sliced zucchini and shrimp to the skillet, and cook for another 3-4 minutes until shrimp is pink and cooked through.\n5. Pour the soy sauce mixture over the shrimp and vegetables, and stir well to coat everything evenly.\n6. Cook for an additional 1-2 minutes until the sauce thickens and coats the Ingredients.\n7. Serve the shrimp stir-fry over cooked rice. Enjoy!\n",
    "\nRecipe: Shrimp Stir-Fry\nIngredients: shrimp, bell peppers, onions, zucchini, soy sauce, garlic, ginger, sesame oil, cornstarch, rice vinegar\nInstructions:\n1. In a small bowl, mix soy sauce, garlic, ginger, sesame oil, cornstarch, and rice vinegar to make the sauce.\n2. Heat a large skillet over medium-high heat and add some oil.\n3. Add the shrimp and cook until pink, then remove from the skillet.\n4. In the same skillet, add more oil and stir-fry the bell peppers, onions, and zucchini until slightly tender.\n5. Return the shrimp to the skillet and pour the sauce over the Ingredients.\n6. Cook for a few more minutes until the sauce thickens and coats the Ingredients.\n7. Serve the shrimp stir-fry hot over rice or noodles.\n",
    "\nRecipe: Loaded Baked Potatoes\nIngredients: potatoes, bacon, cheddar cheese, sour cream, butter, green onions, salt, pepper\nInstructions:\n1. Preheat the oven to 400F (200C).\n2. Wash and scrub the potatoes, then pierce them with a fork a few times.\n3. Bake the potatoes directly on the oven rack for about 45-60 minutes, or until they are tender when pierced with a fork.\n4. In a skillet, cook the bacon until crispy. Remove and crumble it.\n5. Once the potatoes are cooked, slice them open and fluff the insides with a fork.\n6. Top each potato with butter, cheddar cheese, bacon, and a dollop of sour cream.\n7. Season with salt and pepper to taste.\n8. Garnish with chopped green onions before serving.\n",
    "\nRecipe: Beef Stew\nIngredients: potatoes, carrots, peas, onion, beef, beef broth, garlic, thyme, salt, pepper\nInstructions:\n1. Heat oil in a large pot over medium heat.\n2. Add chopped onion and minced garlic, cook until fragrant.\n3. Add cubed beef, cook until browned on all sides.\n4. Pour in beef broth, add diced potatoes and carrots.\n5. Season with thyme, salt, and pepper.\n6. Cover and simmer for 30 minutes, stirring occasionally.\n7. Add peas and cook for an additional 5 minutes.\n8. Serve hot and enjoy!\n",
    "\nRecipe: Quinoa Avocado Salad\nIngredients: quinoa, avocado, black beans, corn, lime, red bell pepper, red onion, cilantro, olive oil, salt, pepper\nInstructions:\n1. Cook quinoa according to package Instructions and let it cool.\n2. In a large bowl, combine cooked quinoa, diced avocado, black beans, corn, diced red bell pepper, diced red onion, and chopped cilantro.\n3. In a small bowl, whisk together the juice of the lime, olive oil, salt, and pepper.\n4. Pour the dressing over the quinoa mixture and toss to combine.\n5. Serve chilled and enjoy!\n",
    "\nRecipe: Tofu and Broccoli Stir-Fry\nIngredients: tofu, broccoli, soy sauce, ginger, sesame oil, garlic, cornstarch, vegetable broth, green onions, red pepper flakes, rice\nInstructions:\n1. Press tofu to remove excess water, then cut into cubes.\n2. In a small bowl, mix soy sauce, minced ginger, minced garlic, and cornstarch.\n3. Heat sesame oil in a large pan over medium heat.\n4. Add tofu cubes and cook until golden brown on all sides.\n5. Remove tofu from the pan and set aside.\n6. In the same pan, add broccoli florets and vegetable broth. Cook until broccoli is tender.\n7. Add the tofu back to the pan, along with the soy sauce mixture, green onions, and red pepper flakes.\n8. Stir well to coat everything in the sauce.\n9. Serve over cooked rice.\n10. Enjoy your delicious tofu and broccoli stir-fry!\n",
    "\nRecipe: Garlic Shrimp Pasta with Cherry Tomatoes\nIngredients: shrimp, pasta, olive oil, garlic, cherry tomatoes, salt, black pepper, red pepper flakes, fresh parsley, lemon juice\nInstructions:\n1. Cook pasta according to package Instructions.\n2. In a large skillet, heat olive oil over medium heat.\n3. Add minced garlic and cook until fragrant.\n4. Add shrimp and cook until pink and cooked through.\n5. Add halved cherry tomatoes and cook until slightly softened.\n6. Season with salt, black pepper, and red pepper flakes to taste.\n7. Add cooked pasta to the skillet and toss to combine.\n8. Squeeze fresh lemon juice over the pasta.\n9. Garnish with chopped fresh parsley before serving.\n",
    "\nRecipe: Apple Cinnamon Pie\nIngredients: apples, cinnamon, sugar, flour, butter, lemon juice, nutmeg, salt\nInstructions:\n1. Preheat the oven to 375F (190C).\n2. Peel and slice the apples.\n3. In a bowl, mix the sliced apples with sugar, cinnamon, nutmeg, lemon juice, and a pinch of salt.\n4. In a separate bowl, combine flour and butter to make the pie crust.\n5. Place the pie crust in a pie dish and fill it with the apple mixture.\n6. Cover the pie with another layer of pie crust or create a lattice pattern.\n7. Bake in the preheated oven for 45-50 minutes or until the crust is golden brown.\n8. Let it cool before serving. Enjoy your delicious apple cinnamon pie!\n",
    "\nRecipe: Tomato Basil Pasta\nIngredients: pasta, tomatoes, basil, garlic, olive oil, salt, pepper\nInstructions:\n1. Cook the pasta according to package Instructions.\n2. In a pan, heat olive oil and saut minced garlic until fragrant.\n3. Add chopped tomatoes and cook until they soften.\n4. Season with salt and pepper.\n5. Add cooked pasta to the pan and toss to combine.\n6. Finish by adding fresh basil leaves and mix well.\n7. Serve hot and enjoy!\n",
    "\nRecipe: Cheesy Spinach and Mushroom Omelette\nIngredients: eggs, cheese, spinach, mushrooms, butter, salt, pepper\nInstructions:\n1. In a bowl, beat the eggs and season with salt and pepper.\n2. Heat butter in a skillet over medium heat.\n3. Add mushrooms and cook until softened.\n4. Add spinach and cook until wilted.\n5. Pour the beaten eggs over the vegetables in the skillet.\n6. Sprinkle cheese on top of the eggs.\n7. Cook until the eggs are set and the cheese is melted.\n8. Fold the omelette in half and serve hot.\n",
    "\nRecipe: Rice and Beans Stir-Fry\nIngredients: rice, beans, bell peppers, onions, garlic, soy sauce, sesame oil, ginger, chili flakes\nInstructions:\n1. Cook rice according to package Instructions.\n2. In a large skillet, heat sesame oil over medium heat.\n3. Add chopped onions, bell peppers, and minced garlic. Cook until softened.\n4. Stir in cooked rice and beans.\n5. Add soy sauce, grated ginger, and chili flakes. Stir well to combine.\n6. Cook for another 5 minutes, stirring occasionally.\n7. Serve hot and enjoy!\n",
    "\nRecipe: Beef Stew\nIngredients: beef, potatoes, carrots, celery, onions, beef broth, garlic, thyme, bay leaves, salt, pepper\nInstructions:\n1. In a large pot, brown the beef over medium-high heat.\n2. Add the onions and garlic, cook until fragrant.\n3. Stir in the carrots, celery, and potatoes.\n4. Pour in enough beef broth to cover the Ingredients.\n5. Add thyme, bay leaves, salt, and pepper.\n6. Bring to a boil, then reduce heat and simmer for 1-2 hours until beef is tender.\n7. Serve hot and enjoy!\n",
    "\nRecipe: Quinoa Avocado Salad\nIngredients: quinoa, avocado, black beans, corn, cilantro, red bell pepper, red onion, lime, olive oil, salt, pepper\nInstructions:\n1. Cook quinoa according to package Instructions and let it cool.\n2. In a large bowl, combine cooked quinoa, diced avocado, drained and rinsed black beans, corn kernels, chopped cilantro, diced red bell pepper, and diced red onion.\n3. In a small bowl, whisk together the juice of a lime, olive oil, salt, and pepper to make the dressing.\n4. Pour the dressing over the salad and toss gently to combine.\n5. Serve chilled and enjoy!\n",
    "\nRecipe: Pork with Apple and Sage Stuffing\nIngredients: pork loin, apples, onions, sage, bread crumbs, butter, salt, pepper\nInstructions:\n1. Preheat the oven to 375F (190C).\n2. In a skillet, melt butter over medium heat. Add chopped onions and cook until translucent.\n3. Add diced apples and cook until slightly softened.\n4. Stir in sage, salt, and pepper.\n5. Remove from heat and mix in bread crumbs to create the stuffing.\n6. Cut a pocket into the pork loin and stuff with the apple and sage mixture.\n7. Season the outside of the pork loin with salt and pepper.\n8. Place the stuffed pork loin in a roasting pan and roast in the preheated oven for about 1 hour or until the internal temperature reaches 145F (63C).\n9. Let the pork rest for 10 minutes before slicing and serving.\n",
    "\nRecipe: Taco Salad\nIngredients: 1 lb ground beef, 1 packet taco seasoning, 1 head lettuce, chopped, 1 tomato, diced, 1 cup shredded cheese, 1/2 cup sour cream, 1/2 cup salsa, 1/4 cup chopped onion, 1/4 cup sliced black olives, 1/4 cup chopped cilantro, 1/4 cup diced avocado, 1/4 cup crushed tortilla chips\nInstructions:\n1. In a skillet, cook the ground beef until browned. Drain excess fat.\n2. Add taco seasoning and water according to package Instructions. Simmer for 5 minutes.\n3. In a large bowl, combine lettuce, tomato, cheese, onion, black olives, and cilantro.\n4. Top with cooked beef mixture.\n5. Serve with sour cream, salsa, avocado, and crushed tortilla chips on the side.\n",
    "\nRecipe: Quinoa Salad with Spinach, Cherry Tomatoes, and Feta Cheese\nIngredients: quinoa, spinach, cherry tomatoes, feta cheese, olive oil, red onion, lemon juice, salt, black pepper\nInstructions:\n1. Cook quinoa according to package Instructions and let it cool.\n2. In a large bowl, combine cooked quinoa, chopped spinach, halved cherry tomatoes, crumbled feta cheese, and thinly sliced red onion.\n3. Drizzle with olive oil and lemon juice, and season with salt and black pepper.\n4. Toss everything together until well combined.\n5. Serve chilled or at room temperature.\n",
    "\nRecipe: Tofu Stir-Fry\nIngredients: tofu, soy sauce, ginger, garlic, broccoli, vegetable oil, cornstarch, sesame oil, rice vinegar, brown sugar, red pepper flakes, green onions\nInstructions:\n1. Press tofu to remove excess water, then cut into cubes.\n2. In a small bowl, mix soy sauce, minced ginger, minced garlic, cornstarch, rice vinegar, brown sugar, and red pepper flakes to make the sauce.\n3. Heat vegetable oil in a pan over medium-high heat.\n4. Add tofu cubes and cook until golden brown on all sides.\n5. Remove tofu from the pan and set aside.\n6. In the same pan, add a bit more oil if needed and stir-fry broccoli until tender-crisp.\n7. Add the tofu back to the pan, pour the sauce over the tofu and broccoli, and stir well to coat.\n8. Cook for a few more minutes until the sauce thickens.\n9. Drizzle with sesame oil and garnish with sliced green onions before serving.\n",
    "\nRecipe: Roasted Rosemary Potatoes\nIngredients: potatoes, rosemary, olive oil, salt, pepper, garlic powder, onion powder\nInstructions:\n1. Preheat the oven to 400F (200C).\n2. Wash and dice the potatoes into small cubes.\n3. In a bowl, mix the diced potatoes with olive oil, salt, pepper, garlic powder, onion powder, and fresh rosemary leaves.\n4. Spread the seasoned potatoes on a baking sheet in a single layer.\n5. Roast in the preheated oven for 25-30 minutes or until the potatoes are golden brown and crispy, stirring halfway through.\n6. Serve hot and enjoy!\n",
    "\nRecipe: Cheesy Pasta Bake\nIngredients: pasta, tomato sauce, cheese, ground beef, onion, garlic, Italian seasoning, salt, pepper\nInstructions:\n1. Preheat the oven to 375F (190C).\n2. Cook the pasta according to package Instructions, then drain and set aside.\n3. In a skillet, cook the ground beef until browned. Add chopped onion and minced garlic, and cook until softened.\n4. Stir in the tomato sauce, Italian seasoning, salt, and pepper. Simmer for a few minutes.\n5. Combine the cooked pasta with the meat sauce mixture, then transfer to a baking dish.\n6. Top with shredded cheese and bake in the preheated oven for 20-25 minutes, or until the cheese is melted and bubbly.\n7. Serve hot and enjoy!\n",
    "\nRecipe: Rice and Beans Stir-Fry\nIngredients: rice, beans, bell pepper, onion, garlic, soy sauce, sesame oil, ginger, salt, pepper\nInstructions:\n1. Cook rice according to package Instructions.\n2. In a large skillet, heat sesame oil over medium heat.\n3. Add chopped onion, bell pepper, and minced garlic. Cook until softened.\n4. Stir in cooked rice and beans. Add soy sauce, ginger, salt, and pepper.\n5. Cook for a few more minutes until everything is heated through.\n6. Serve hot and enjoy!\n",
    "\nRecipe: Garlic Butter Lemon Salmon\nIngredients: salmon, lemon, garlic, butter, salt, black pepper, fresh parsley\nInstructions:\n1. Preheat the oven to 400F (200C).\n2. Place the salmon fillets on a baking sheet lined with parchment paper.\n3. In a small bowl, mix melted butter, minced garlic, lemon juice, salt, and black pepper.\n4. Brush the butter mixture over the salmon fillets.\n5. Slice the lemon and place a few slices on top of each fillet.\n6. Bake in the preheated oven for 12-15 minutes, or until the salmon is cooked through.\n7. Garnish with chopped fresh parsley before serving.\n",
    "\nRecipe: Taco Salad\nIngredients: 1 lb ground beef, 1 packet taco seasoning, 1 head lettuce, chopped, 1 cup shredded cheese, 1 cup salsa, 1/2 cup diced tomatoes, 1/2 cup sliced black olives, 1/4 cup diced red onion, 1/4 cup sour cream, 1/4 cup chopped cilantro, 1/4 cup sliced jalapenos, 1/4 cup crushed tortilla chips\nInstructions:\n1. In a skillet, cook the ground beef over medium heat until browned. Drain excess fat.\n2. Add taco seasoning and water according to package Instructions. Simmer for 5 minutes.\n3. In a large bowl, combine chopped lettuce, shredded cheese, salsa, diced tomatoes, black olives, red onion, sour cream, cilantro, and jalapenos.\n4. Add cooked ground beef mixture to the bowl and toss to combine.\n5. Serve the taco salad topped with crushed tortilla chips.\n",
    "\nRecipe: Loaded Baked Potatoes\nIngredients: potatoes, bacon, cheddar cheese, sour cream, butter, green onions, salt, pepper\nInstructions:\n1. Preheat the oven to 400F (200C).\n2. Wash and scrub the potatoes, then pierce them with a fork a few times.\n3. Bake the potatoes directly on the oven rack for about 45-60 minutes, or until they are tender when pierced with a fork.\n4. In a skillet, cook the bacon until crispy. Remove and crumble it.\n5. Once the potatoes are cooked, slice them open and fluff the insides with a fork.\n6. Top each potato with butter, cheddar cheese, bacon, and a dollop of sour cream.\n7. Season with salt and pepper to taste.\n8. Garnish with chopped green onions before serving.\n",
    "\nRecipe: Shrimp and Spinach Pasta\nIngredients: shrimp, pasta, spinach, tomatoes, garlic, olive oil, salt, black pepper, red pepper flakes, parmesan cheese\nInstructions:\n1. Cook the pasta according to package Instructions.\n2. In a large skillet, heat olive oil over medium heat.\n3. Add minced garlic and cook until fragrant.\n4. Add shrimp and cook until pink and cooked through.\n5. Add chopped tomatoes and spinach, cook until spinach wilts.\n6. Season with salt, black pepper, and red pepper flakes to taste.\n7. Add cooked pasta to the skillet and toss to combine.\n8. Serve hot, garnished with grated parmesan cheese.\n",
    "\nRecipe: Ginger Tofu Stir-Fry\nIngredients: tofu, soy sauce, ginger, green beans, garlic, onion, bell pepper, cornstarch, vegetable oil, rice vinegar, sesame oil\nInstructions:\n1. Press tofu to remove excess water, then cut into cubes.\n2. In a bowl, mix soy sauce, rice vinegar, sesame oil, and cornstarch. Add tofu cubes and marinate for 15 minutes.\n3. Heat vegetable oil in a pan over medium heat. Add tofu cubes and cook until browned on all sides. Remove from pan and set aside.\n4. In the same pan, saut minced garlic, sliced onion, sliced bell pepper, and sliced ginger until fragrant.\n5. Add green beans and stir-fry until slightly tender.\n6. Return tofu to the pan and mix well with the vegetables.\n7. Pour in the remaining marinade and cook until the sauce thickens.\n8. Serve hot over rice or noodles.\n",
    "\nRecipe: Quinoa Black Bean Salad\nIngredients: quinoa, black beans, corn, avocado, red bell pepper, red onion, cilantro, lime, olive oil, salt, pepper\nInstructions:\n1. Cook quinoa according to package Instructions and let it cool.\n2. In a large bowl, combine cooked quinoa, black beans, corn, diced avocado, diced red bell pepper, diced red onion, and chopped cilantro.\n3. In a small bowl, whisk together lime juice, olive oil, salt, and pepper to make the dressing.\n4. Pour the dressing over the salad and toss gently to combine.\n5. Serve chilled and enjoy!\n",
    "\nRecipe: Mediterranean Chickpea Salad\nIngredients: chickpeas, cucumber, feta cheese, olives, red onion, cherry tomatoes, fresh parsley, lemon juice, olive oil, salt, black pepper\nInstructions:\n1. Rinse and drain the chickpeas.\n2. Chop the cucumber, feta cheese, olives, red onion, and cherry tomatoes into bite-sized pieces.\n3. Finely chop the fresh parsley.\n4. In a large bowl, combine the chickpeas, cucumber, feta cheese, olives, red onion, cherry tomatoes, and parsley.\n5. In a small bowl, whisk together lemon juice, olive oil, salt, and black pepper to make the dressing.\n6. Pour the dressing over the salad and toss gently to combine.\n7. Serve chilled and enjoy!\n",
    "\nRecipe: Pork Stir-Fry with Cabbage\nIngredients: pork, cabbage, ginger, garlic, soy sauce, vegetable oil, onion, carrot, bell pepper, cornstarch, rice vinegar\nInstructions:\n1. Slice the pork into thin strips and marinate with soy sauce, ginger, and garlic.\n2. Heat vegetable oil in a pan and stir-fry the marinated pork until cooked through.\n3. Add sliced onion, carrot, and bell pepper to the pan and cook until slightly softened.\n4. Toss in shredded cabbage and continue to stir-fry until vegetables are tender.\n5. In a small bowl, mix cornstarch with water to create a slurry and pour into the pan to thicken the sauce.\n6. Add a splash of rice vinegar for extra flavor and serve hot.\n",
    "\nRecipe: Shrimp and Avocado Ceviche\nIngredients: shrimp, avocado, cilantro, lime, red onion, tomato, jalapeno, salt, pepper\nInstructions:\n1. Cook the shrimp in boiling water until pink and cooked through. Drain and let cool.\n2. Chop the shrimp into bite-sized pieces and place in a large bowl.\n3. Dice the avocado, red onion, tomato, and jalapeno. Add them to the bowl with the shrimp.\n4. Finely chop the cilantro and add it to the bowl.\n5. Squeeze the lime juice over the mixture and season with salt and pepper.\n6. Gently toss everything together until well combined.\n7. Cover and refrigerate for at least 30 minutes to allow the flavors to meld.\n8. Serve the shrimp and avocado ceviche chilled, garnished with additional cilantro leaves.\n",
    "\nRecipe: Chickpea, Spinach, and Tomato Curry\nIngredients: chickpeas, spinach, tomatoes, cumin, onion, garlic, ginger, coriander, turmeric, coconut milk, vegetable broth, salt, pepper\nInstructions:\n1. Heat oil in a large pot over medium heat.\n2. Add chopped onion, garlic, and ginger. Cook until softened.\n3. Stir in cumin, coriander, and turmeric. Cook for 1 minute.\n4. Add chopped tomatoes and cook until they start to break down.\n5. Pour in coconut milk and vegetable broth. Bring to a simmer.\n6. Add chickpeas and simmer for 10 minutes.\n7. Stir in spinach and cook until wilted.\n8. Season with salt and pepper to taste.\n9. Serve hot over rice or with naan bread.\n"
]